{
  "linkedin_api_changes": {
    "hash": "febd6441acf50e38da438e0f30c3020f4cc5bfb382ebae0f8ad23b96e1d944a0",
    "text": "Note\nAccess to this page requires authorization. You can try signing in or changing directories.\nAccess to this page requires authorization. You can try changing directories.\nWarning\nDeprecation Notice\nThe Marketing Version 202408 (Marketing August 2024) has been sunset. We recommend that you migrate to the latest versioned APIs to avoid disruptions. See the Migration page for more details.\nIf you havenât yet migrated and have questions, submit a request on the LinkedIn Developer Support Portal.\nAugust 2025 - Version 202508 (Latest)\nProduct & Platform Announcements\nCampaigns API: Political Advertising Declaration for EU-Targeted Campaigns\nStarting October 10, 2025, advertisers running campaigns targeting the EU region must self-declare if their ads qualify as political advertising under the EUâs Transparency and Targeting of Political Advertising (TTPA) regulation. To facilitate this action, Campaign Management partners are now required to implement a self-declaration step in the LinkedIn campaign creation flow for campaigns targeting the EU region. Partners must pass back this information with LinkedIn via the\npoliticalIntent\nfield in the /adCampaigns schema.Although LinkedIn prohibits political advertising and will continue to do so, this update is required to ensure regulatory compliance and maintain a trusted platform for our members and customers.\nConversions API Payload Builder: Enhanced Validation & Direct API Call Support\nThe Conversions API Payload Builder now supports capabilities to enable seamless and efficient integration process for Conversions API. Developers can build and validate syntactically correct /conversionEvents payloads, auto-generate JSON or cURL formats, and test them directly on LinkedIn Developer Portal via the new âMake an API Callâ feature.\nThis self-serve feature streamlines development effort by enabling OAuth access token generation through either a developerâs own app (if API access is provisioned) or a LinkedIn-owned app. Refer to the technical documentation for implementation details.\nDeveloper AI Chatbot: Now on the LinkedIn Developer Website\nOur AI-powered chatbot support has expanded from the Developer platform to the LinkedIn Developer website, making it easier for developers to discover and learn more about LinkedIn API products and access relevant technical information to get started.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202408 - Aug 18, 2025\n- 202409 - Sep 15, 2025\n- 202410 - Oct 15, 2025\nReminders\nCreatives API: Support for Innovid VAST Tags in Video Ads for CTV\nStarting with the 202507 version, partners can utilize VAST tags to streamline the setup and asset management of Connected TV (CTV) ad campaigns. The\ncontent\nfield in the Creatives API schema now includes a new field,thirdPartyVastTagVideoAd\n, where you can provide avastTagUrl\nfrom a third-party VAST tag vendor hosting the video content. Currently, only Innovid VAST tags are supported.VAST tags enhance efficiency of CTV campaigns by simplifying asset delivery and allowing for more creative flexibility, testing, and reporting. For complete CTV specifications, refer to the CTV Ads Specifications.\nJuly 2025 - Version 202507\nProduct & Platform Announcements\nCreatives API: Support for Innovid VAST Tags in Video Ads for CTV\nStarting with the 202507 version, partners can utilize VAST tags to streamline the setup and asset management of Connected TV (CTV) ad campaigns. The\ncontent\nfield in the Creatives API schema now includes a new field,thirdPartyVastTagVideoAd\n, where you can provide avastTagUrl\nfrom a third-party VAST tag vendor hosting the video content. Currently, only Innovid VAST tags are supported.VAST tags enhance efficiency of CTV campaigns by simplifying asset delivery and allowing for more creative flexibility, testing, and reporting. For complete CTV specifications, refer to the CTV Ads Specifications.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202407 - Jul 22, 2025\n- 202408 - Aug 15, 2025\n- 202409 - Sep 15, 2025\nReminders\nSunset of legacy Lead Sync APIs on July 31, 2025\nLinkedInâs legacy Lead Sync APIs will be fully sunset on July 31, 2025. Legacy endpoints that will be sunset include:\n/adForms\n,/adFormResponses\n,/leadNotificationUrls\n. To prevent service disruptions and ensure access to the latest features, we recommend completing your migration using the migration guide before July 31, 2025.Consider implementing:\n- In-product notifications to encourage customer action\n- A forced re-authentication flow to prompt customers to reconnect with the new API\nIf the migration is not completed by the sunset date, customers will no longer be able to sync leads using the legacy Ads Lead Sync API and Events Lead Generation API, leading to significant disruptions in lead delivery and campaign workflows. Migrating to the new Lead Sync API provides access to new features, improved functionality, and enhanced performance. These include the ability to centralize lead collection from ads, events, and other organic sources via a single, streamlined API.\nCommunity Management API Enhancements: Empower Customers to Measure and Grow Influence\nPartners can provide detailed analytics on executive, employee, and brand engagement with LinkedIn audiences. These updates provide increased visibility into individual profile analytics, including metrics for content performance and follower growth, supporting improved influencer and creator strategies on LinkedIn.\nKey capabilities include:\n- Content Analytics: Access granular metrics for member-generated content, including impressions, reach, and engagement (reactions, comments, reposts) across individual posts or aggregated content.\n- Follower Growth Tracking: Track follower trends over custom timeframes to uncover momentum, identify growth spikes, and assess engagement patterns.\n- Video Insights: Measure short-form video performance, a popular content format on LinkedIn with metrics such as watch time, total views, and unique viewers.\nThese enhancements support social media management tools, executive visibility platforms, and influencer analytics providers, enabling measurement and analysis of influence and impact on LinkedIn. For more details, refer to the community management use cases.\nJune 2025 - Version 202506\nProduct & Platform Announcements\nMember Follower Statistics API: Power your platform by integrating LinkedInâs member follower statistics API to report insights on gained member followers for authenticated members and motivate members to create high-quality content on LinkedIn. Community Management API partners can now retrieve the total follower count of authenticated members from a new endpoint\nGET /memberFollowersCount\nthat supports two query finders:q=me\nto query life-time followers count (starting with the 202504 version), andq=dateRange\n, to query time-bound followers count by date range (starting with the 202505 version). This API requires additional member consent from a new permission calledr_member_profileAnalytics\n, which is included in the Community Management API. This endpoint is a âmember profileâ version of a similar endpoint for âorganizationâ (GET /organizationalEntityFollowerStatistics\n).Member Post Statistics API: Power your platform by integrating LinkedInâs member post statistics API to report insights on member single post performance, as well as aggregated member posts, and motivate members to create high-quality content on LinkedIn. Community Management API partners can now retrieve IMPRESSION, MEMBERS_REACHED, REACTION, COMMENT, or RESHARE of either a single member post or all aggregated posts of authenticated members, from a new endpoint,\nGET /memberCreatorPostAnalytics\nthat supports two query finders:q=me\n, to query aggregated member posts statistics, andq=entity\n, to query a single member post statistics (starting with the 202506 version). This API requires additional member consent from a new permission calledr_member_postAnalytics\n, which is included in the Community Management API.Member Video Statistics API: Power your platform by integrating LinkedInâs member video statistics API to report insights on video performance of the member post and motivate members to create high-quality video content on LinkedIn. Community Management API partners can now retrieve VIDEO_PLAY, VIDEO_WATCH_TIME, or VIDEO_VIEWER of a single member video post from a new endpoint,\nGET /memberCreatorVideoAnalytics\nthat supports one query finderq=entity\nto query a single member video post statistics (starting with the 202506 version). This API requires additional member consent from a new permission calledr_member_postAnalytics\n, which is included in the Community Management API.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202406 - Jun 16, 2025\n- 202407 - Jul 22, 2025\n- 202408 - Aug 15, 2025\nReminders\nSunset of Legacy Ad Lead Gen API on July 31, 2025\n- Legacy endpoints that will be sunset: /adForms, /adFormResponses, /leadNotificationUrls. If not migrated to the new endpoints, follow the migration guide here.\nAd Analytics API: Revenue Attribution Metrics now available\nPartners now have access to key business outcome metrics through the Ad Analytics API, allowing you to demonstrate LinkedInâs impact, optimize sales and marketing strategies, and enhance lower funnel efficiency and effectiveness. Starting with the 202505 version, by using the new query finder\nq=attributedRevenueMetrics\non GET /adAnalytics endpoint for ACCOUNT, CAMPAIGN_GROUP, CAMPAIGN pivots, partners can provide a real-time view of LinkedInâs influence on CRM events, such as the number of CRM leads, pipeline value, and revenue, to their customers.Additionally, we have introduced a new object revenueAttributionMetrics in the response schema, which includes several new fields for revenue attribution metrics for accounts that have connected their CRM with LinkedIn. We support CRM connections with Dynamics 365, Salesforce and HubSpot.\nNew Postman collection folder with sample requests for revenue attribution added here.\nAdd Business Email to Linkedin Application: Do not miss critical LinkedIn communications.\nWe recommend partners to add their preferred business email address to their LinkedIn application to stay informed about critical LinkedIn Developer platform and product updates, including migration or deprecation notices, new APIs, or changes to current APIs. This ensures that you do not miss important LinkedIn communications and helps prevent service interruptions, broken integrations, or loss of functionality.\nMay 2025 - Version 202505\nProduct & Platform Announcements\nLinkedIn Events Enhancements:\nEvents Management API: Create LinkedIn Live Test Events\nPartners can now create LinkedIn Live Events on their customer's LinkedIn company page for testing purposes using a new optional field called\ntestEvent\nin the request schema for POST /events. The default value is set tofalse\n, and when set totrue\n, if the event organizer is an organization, the event is treated as a test event visible only to that organization's page admins or those with a direct URL to the event page.Test events allow organizers to test connecting their live stream to their LinkedIn event without broadcasting to company page followers, preventing LinkedIn members from discovering it, receiving notifications, or accidentally joining. This setting can only be specified during event creation, and the visibility of the event cannot be changed afterward.\nCreatives Management API: Add Video Preview to Event Ads\nThe POST /creatives endpoint now supports Event Ad creatives. For promoted LinkedIn Live events with registration forms, you can specify whether to display a video preview in the ad using the event ad boolean property\nhidePreviewVideo\n. This field is optional and defaults tofalse\n, which plays a 30-second preview of the event livestream or recording before viewers are asked to register.\nProviding a preview of the event content before requiring registration has been shown to increase views and registration submission rates. If an advertiser chooses to fully gate an event behind a registration form, the value of this property can be changed totrue\nfor existing creatives through partial-update requests. By changing this value totrue\n, the target audience will be required to register for the event before seeing any part of the live stream or event recording.\nLearn more about how our new Event API offerings unlock the power of event marketing and help your customers stand out in the current landscape of B2B events with an elevated strategy and approach.\nAd Analytics API: Launching Revenue Attribution Metrics\nWe are excited to announce the availability of key business outcome metrics through the Ad Analytics API, enabling partners to demonstrate LinkedInâs impact, optimize sales and marketing strategies, and enhance lower funnel efficiency and effectiveness. Starting with the 202505 version, by using the new query finder\nq=attributedRevenueMetrics\non GET /adAnalytics endpoint for ACCOUNT, CAMPAIGN_GROUP, CAMPAIGN pivots, partners can provide a real-time view of LinkedInâs influence on CRM events, such as the number of CRM leads, pipeline value, and revenue, to their customers.Additionally, we have introduced a new object revenueAttributionMetrics in the response schema, which includes several new fields for revenue attribution metrics for accounts that have connected their CRM with LinkedIn. We support CRM connections with Dynamics 365, Salesforce and HubSpot.\nConversions API: Support for 365-day Lookback Window\nThe Conversions API now allows you to set a 365-day conversion lookback window for\npostClickAttributionWindowSize\nandviewThroughAttributionWindowSize\nwhen creating a new conversion rule with POST /conversions for the following conversion types: SUBMIT_APPLICATION, PURCHASE, ADD_TO_CART, QUALIFIED_LEAD, and LEAD. For all other conversion types, allowed values remain the same (1, 7, 30, 90 days). We recommend using a longer conversion window to capture and attribute conversions from longer B2B sales cycles and ensure accurate attribution for infrequent conversions. This update has been released to all active versions.Add Business Email to LinkedIn Application: Do not miss critical LinkedIn communications\nWe are pleased to share that partners can now add their preferred business email address to their LinkedIn application to stay informed about critical LinkedIn Developer platform and product updates, including migration or deprecation notices, new APIs, or changes to current APIs. This will ensure you do not miss important LinkedIn communications, preventing interrupted service, broken integrations, or loss of functionality.\nVerified on LinkedIn Pilot: Add LinkedIn Verification to your Platform\nPartners now have the ability to leverage LinkedIn verification through Verified on LinkedIn feature. This enables their users to showcase their LinkedIn verification status on the partner platform, helping companies and users benefit from communities with known identities that foster trust and drive engagement. We are currently accepting requests to onboard new platforms. Submit your request here.\nAd Account Users API Updates:\nAccount User Search Update:\nThe GET /adAccountUsers endpoint with the\nq=accounts\nquery parameter now limits user searches to only one ad account. It will return matching results for only the first ad account ID, even if multiple ad account IDs are provided in theaccounts\nquery parameter. This change in behavior applies to all previous versions.Unversioned Ad Account Users API: Sunset:\nStarting from July 1st 2025, the deprecated unversioned API for Ad Account Users will be sunset. Please note that any calls to the API will return a 4xx error. You are recommended to use the versioned Ad Account Users API for continued access.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202405 - May 15, 2025\n- 202406 - Jun 16, 2025\n- 202407 - Jul 15, 2025\nReminders\nBoost Event Reach and Results with LinkedIn Event Ads In a crowded content landscape, B2B events remain crucial for connecting with target audiences, generating quality leads, and boosting conversions. Overcome 'event fatigue' with smarter strategies and tools powered by our new Events offerings: Event Management and Event Ads APIs. A recent Salesforce case study demonstrated that leveraging LinkedIn Events resulted in a 30% cost reduction, a 24% increase in connection requests, and a 52% increase in InMail acceptance. Learn more here.\nCampaign Recommendations API Sunset: Starting with the 202503 version, the\nadCampaignRecommendations\nandadCampaignInsights\nAPIs have been fully sunset. Please note that any calls to these APIs using a deprecated version header will return a 426 status code error.\nApril 2025 - Version 202504\nProduct & Platform Announcements\nCampaign Groups API: Campaign Group Budget Optimization With Daily Budget\nStarting with the version 202504, weâve added an optional\ndailyBudget\nfield to the campaign group object in the request payload for POST /adCampaignGroups. This enhancement allows you to set or update the daily budget at the campaign group level via API, similar to LinkedIn Campaign Manager. When BudgetOptimizationStrategy =DYNAMIC\nis applied to a campaign group, budget optimization will be performed at the group level, and the daily budget will be shared among all campaigns within the campaign group.Posts API: Support for Buy/Shop Now Call to Action\nStarting with the version 202504, partners can read and create Buy/Shop Now call to action (CTA) via the Posts API. Ecommerce advertisers frequently use this type of CTA to encourage their target audience to purchase their product or service. When contentCallToActionLabel is available, \"BUY_NOW\" and \"SHOP_NOW\" will be eligible inputs.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202404 - Apr 15, 2025\n- 202405 - May 15, 2025\n- 202406 - Jun 16, 2025\nReminders\nLinkedIn Ads Partner Product Showcase\nWe released our Q1 2025 Partner Product Showcase to keep our partners informed about our latest product innovations, platform enhancements, and efforts to help our partners grow and marketers do more on LinkedIn. Discover how our APIs can unlock new possibilities: the Event APIs can improve event ROI, the Conversions API facilitates full-funnel measurement, and the Connected TV API enables targeted campaigns on the fastest-growing media channel. Read more here.\nMarch 2025 - Version 202503\nProduct & Platform Announcements\nConversions API Enhancements:\nAccess Token Generation in Campaign Manager for Direct API: Advertisers that directly send their conversions data to LinkedIn Conversions API without integrating through supported partner platforms will now have the ability to generate access tokens for authentication directly from their Campaign Manager Ad Account. They will no longer be required to create a developer application and apply to Conversions API. The generated access tokens will have no expiry. Learn more.\nBuild Payload with easeâ: We are making it easy for developers to build the payload body of /conversionEvents endpoint and bring the auto formatted, syntactically correct json/CURL to the API call.â This aims to reduce developer's effort to build the payloadâ, minimize the number of errors a developer would encounterâ and make integration effort seamless & efficient.\nAd Targeting Entities API: Filter Geographies Eligible for CTV-Only Campaigns Starting with the 202503 version, we have introduced a new optional field\nuseCase\nin thetypeahead\nfinder of the Ad Targeting Entities API. This update also includes theCONNECTED_TELEVISION_ONLY_CAMPAIGN\nvalue, which allows filtering for geo-targeting entities eligible for CTV-only campaigns. Utilizing this field will help you automatically align with LinkedInâs CTV supported geo locations when changes are made.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202404 - Apr 15, 2025\n- 202405 - May 15, 2025\n- 202406 - Jun 16, 2025\nDocumentation Enhancements\n- Audience Insights API Use Cases: Now Available\nWeâve launched a new use cases page for the Audience Insights API. Please visit the page to explore how the API can be utilized.\nFebruary 2025 - Version 202502\nProduct & Platform Announcements\nEvents Management API: Create and Manage LinkedIn Events\nWe are excited to announce that partners can now create, schedule, and manage LinkedIn Events, including LinkedIn Live events or external events on LinkedIn, through a new Event Management API. These events generate a dedicated event page on LinkedIn and are shared via a post with the followers of your customersâ company page, allowing LinkedIn members to easily discover your customersâ events, register, join live streams, and engage in post-event activities.Starting with the version 202502, we are introducing two exciting capabilities for event organizers:\n- Three new methods, CREATE, DELETE, and PARTIAL_UPDATE,\nare now available on/events\nin a new API product. A new permissionrw_events\nis now available in the Events Management API to allow POST and DELETE methods requiring write access, while the GET /events API requiresr_events\npermission to allow read only access. Developers can now request access to this new API product from their LinkedIn developer portal to include therw_events\npermission in their Oauth flow and authenticate LinkedIn members to call these methods. - Ability to create events with custom registration forms. When creating an event via the Event Management API, partners now have the ability to attach a custom registration form. This allows for a frictionless registration process for LinkedIn members and guarantees relevant information is collected for all attendees of the event.\nBeyond creating and scheduling events, the Event Management API enables partners to update event settings in real time, including modifying event content, start and end times, etc. Partners can also delete events or use them for promotional purposes by leveraging the Event Ads API.\n- Three new methods, CREATE, DELETE, and PARTIAL_UPDATE,\nDMP Segments Users API and DMP Segments Companies API: BATCH_CREATE Method Enhancements\nThe BATCH_CREATE method for streaming audience data of multiple users in POST /dmpSegments/users and multiple companies in POST /dmpSegments/companies has been enhanced. We now support partial batch request validation, allowing the processing of all valid elements in a batch sent in the request payload. Additionally, we return a batch response array with HTTP response status for each element, including batchIndex\nto specify the exact index of each invalid record in the array. These improvements have been applied to all past active versions starting January 22, 2025.\n- Media Planning API: Forecast Cost-Per-KeyResult (CPX)\nPartners can now access forecast results for CPL (Cost-Per-Leads), CPR (Cost-Per-Reach), and CPM (Cost-Per-Thousand Impressions) directly through the Media Planning API. This functionality empowers users to visualize and analyze how these metrics interact with the traditional metrics such as reach, impressions and lead. More details can be found here.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202403 - Mar 17, 2025\n- 202404 - Apr 15, 2025\n- 202405 - May 15, 2025\nReminders\nEvent Ads API: Create and Manage Event Ads\nThe Event Ads API enables campaign management partners to seamlessly create and manage Event Ads for their customers. LinkedIn Event Ads allow for scaled distribution of events directly in the LinkedIn feed to a specified target audience driving engagement, registrations, and generating live (and post-live) views. Additionally, Event Ads have unique capabilities that make them compelling for event marketers:\n- Dynamic creative rendering: Ad changes from an image to a live stream to a video replay based on the event phase.\n- Accelerated delivery mechanism: Given the importance and timeliness of live events, Event Ad campaigns can leverage an accelerated delivery option as part of the bidding strategy to get the most eyes on the event while itâs live.\n- Frictionless pre-event member experience: LinkedIn members can register for an event with a single click and registrants are notified when the event is starting to encourage attendance and engagement.\n- Post-event retargeting: Partners can create audiences based on registrations, viewership, or engagement and continue moving them down the funnel.\nWith the Event Ads API, partners can create ads for various event types, including LinkedIn Live events and external events, specify campaign objectives (e.g., brand awareness, website visits, engagement), set start and end times, and manage budgets. Audio Events are not currently supported.\nJanuary 2025 - Version 202501\nProduct & Platform Announcements\nEvent Ads API: Create and Manage Event Ads\nThe Event Ads API enables campaign management partners to seamlessly create and manage Event Ads for their customers. LinkedIn Event Ads allow for scaled distribution of events directly in the LinkedIn feed to a specified target audience driving engagement, registrations, and generating live (and post-live) views. Additionally, Event Ads have unique capabilities that make them compelling for event marketers:\n- Dynamic creative rendering: Ad changes from an image to a live stream to a video replay based on the event phase.\n- Accelerated delivery mechanism: Given the importance and timeliness of live events, Event Ad campaigns can leverage an accelerated delivery option as part of the bidding strategy to get the most eyes on the event while itâs live.\n- Frictionless pre-event member experience: LinkedIn members can register for an event with a single click and registrants are notified when the event is starting to encourage attendance and engagement.\n- Post-event retargeting: Partners can create audiences based on registrations, viewership, or engagement and continue moving them down the funnel.\nWith the Event Ads API, partners can create ads for various event types, including LinkedIn Live events and external events, specify campaign objectives (e.g., brand awareness, website visits, engagement), set start and end times, and manage budgets. Audio Events are not currently supported.\nCampaign Groups API: Budget Optimization Support\nStarting with the 202501 version, weâve introduced an optional\nbudgetOptimization\nfield to the campaign group object in the request payload for POST /adCampaignGroups. This feature allows you to modify the bid strategy and budget optimization strategy via API, similar to the support available in LinkedIn Campaign Manager. The bid strategy lets you select the bidding action strategy, while the budget optimization strategy determines how the budget is allocated across campaigns within campaign groups.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202401 - Jan 22, 2025\n- 202402 - Feb 17, 2025\n- 202403 - Mar 17, 2025\nReminders\nEvents API: Updated Schema\nStarting with the 202411 version, we've made significant improvements to the Events schema to enhance and streamline the developer experience. Please ensure to use the updated schema to prevent any issues with event lead syncing.\nDocumentation Enhancements\n- Media Planning API Use Cases: Now Available\nWeâve launched a new use cases page for the Media Planning API. Please visit the page to explore how the API can be utilized.\nNovember 2024 - Version 202411\nProduct & Platform Announcements\nConversions API: External IDs Support\nStarting with the 202410 version, weâve introduced an optional\nexternalIds\nfield to the user object in the request payload for POST /conversionEvents. This allows you to send unique custom identifiers (such as user IDs, loyalty membership IDs, and external cookie IDs) to improve signal quality, identity resolution, and match ratesâall without repeatedly sending the same PII. If we match a LinkedIn member from user attributes in the event, the âexternalIdsâ provided will be associated with that member. For future events, simply sending âexternalIdsâ will enable us to match based on that identifier alone.Ad Previews API: Live Preview for Ad Creatives\nStarting with the 202411 version, partners can preview ad creatives before the ads are created, through the Live Preview feature. We have introduced two new methods on /adPreviews endpoint:\naction=livePreviewForCreative\nandaction=livePreviewForCreativeInline\nto support previews for both creatives and creative inline content. You can embed the HTML iFrame tag returned in the response to render live preview for both Desktop and Mobile placements. This feature supports the following ad formats: Single image ad, Carousel ad, Video ad, Single job ad and Event ad.Ad Analytics API: New Metrics\naudiencePenetration\nandaverageDwellTime\nWe are introducing two new metrics via Ad Analytics API:\n- Audience Penetration: This measures the approximate number of unique members reached by the advertiser divided by the approximate total target audience. Currently, this metric is not available at the creative level. Read more.\n- Average Dwell Time: This measures the average time (in seconds) that users spend viewing the ad when at least 50% of the pixels are present on the screen. Learn more.\nInsight Tag Conversion Tracking API & Conversions API: New\nvalueType\nFieldStarting with the 202411 version, we have added an optional field\nvalueType\nin request payload for POST /conversions. This allows you to specify whether the conversion value is fixed from the conversion rule config (FIXED\n) or dynamic from the conversion events streaming (DYNAMIC\n) to ensure accurate reporting and inform performance optimization.Events API: Updated Schema\nStarting with the 202411 version, we've made significant improvements to the Events schema to enhance and streamline the developer experience. Please ensure to use the updated schema to prevent any issues with event lead syncing.\nMatched Audiences API: Updated endpoint for DMP Segment List Uploads\nStarting with the 202411 version, the CSV List File Upload endpoint used for audience creation has migrated from POST\n/media/upload\nto POST/dmpSegments?action=generateUploadUrl\nendpoint. This is now a two-step process to first generate an upload URL and then upload a CSV file on the generated URL returned in thevalue\nfield in the response body of POST/dmpSegments?action=generateUploadUrl\n. To avoid service interruption, partners using older versions of the DMP Segment List Uploads API should migrate to version 202411. More information can be found here.Media Planning API: Save and Retrieve Media Plans\nStarting with the 202411 version, Media Planning API will support saving and retrieving media plans via a new endpoint /mediaPlans. Use this endpoint to create and fetch media plans within an ad account. More details can be found here.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202306 - Dec 16, 2024\n- 202307 - Dec 16, 2024\n- 202311 - Nov 15, 2024\n- 202312 - Dec 16, 2024\n- 202401 - Jan 15, 2025\nReminders\nSponsored Messaging in the European Union (EU)\nStarting October 2024, we enabled EU targeting for Sponsored Messaging campaigns including Message Ads & Conversation Ads, helping partners reach the target audience for their customer campaigns more effectively in the EU. Only EU members who agreed to receive Sponsored Messaging ads in their LinkedIn inbox, will be eligible to receive this ad type. Campaign setup, delivery, and reporting will function the same as all other Sponsored Messaging campaigns, now with the option to target within the EU. Learn more.\nWhile serving to eligible EU members is enabled automatically by LinkedIn, please ensure to update any platform validations or tooltips and external articles on your end to reflect this change.\nWe encourage you to plan for Sponsored Messaging EU targeting with a test-and-learn approach. Because EU members can choose/update how theyâd like to receive ads in their inbox at any time, you may find differences in audience size when using Sponsored Messaging ads compared to other formats.\nOctober 2024 - Version 202410\nProduct & Platform Announcements\nUpcoming changes to Sponsored Messaging in the European Union (EU)\nStarting mid-October 2024, we will enable EU targeting for Sponsored Messaging campaigns including Message Ads & Conversation Ads, helping partners reach the target audience for their customer campaigns more effectively in the EU. Only EU members who agreed to receive Sponsored Messaging ads in their LinkedIn inbox, will be eligible to receive this ad type. Campaign setup, delivery, and reporting will function the same as all other Sponsored Messaging campaigns, now with the option to target within the EU. Read more.\nWhile serving to eligible EU members is enabled automatically by LinkedIn, please ensure to update any platform validations or tooltips and external articles on your end to reflect this change.\nWe encourage you to plan for Sponsored Messaging EU targeting with a test-and-learn approach. Because EU members can choose/update how theyâd like to receive ads in their inbox at any time, you may find differences in audience size when using Sponsored Messaging ads compared to other formats.\nCreatives API : Creative Naming Support\nStarting with the 202410 version, you can add creative names to your ads using the new\nname\nfield in the Creatives API. This field is supported across all creative formats. We recommend adopting this approach as we plan to deprecate the legacy options like InMailContents API or the AdDirectSponsoredContents API in the near future.Ad Analytics API: Event Stage Reporting\nIn order to enable more granular reporting for Event Ads, the Analytics and Statistics finders now support\nEVENT_STAGE\nas a new ad analytics pivot to get analytics data for Event Ads based on the Event stage.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202306 - Dec 16, 2024\n- 202307 - Dec 16, 2024\n- 202308 - Aug 16, 2024\n- 202309 - Sep 16, 2024\n- 202310 - Oct 15, 2024\n- 202311 - Nov 15, 2024\n- 202312 - Dec 16, 2024\nReminders\nAssociate and Verify your App: LinkedIn Company Page\nPlease ensure that your developer app is associated with a LinkedIn Company Page to have access to the necessary features and functionality of LinkedIn Marketing API products. The organization that owns the Page you select will function as the publisher of the app. If you donât have a Page, you have the option to create a Page. As a developer, you must send an app verification request to your organizationâs Page super admin, who is responsible for approving or denying the request to associate an app with a LinkedIn Page. Read more.\nAdAccounts, Campaign Groups, Campaigns, Creative API: Adopt Cursor-based Pagination\nStarting with the January 2024 version (202401) we moved from index-based to cursor-based pagination for better scalability of our platform. To properly paginate you will need to use the pageSize and pageToken query parameters.\nSeptember 2024 - Version 202409\nProduct & Platform Announcements\nConnected TV (CTV) Campaigns: Brand Safety Capabilities\nLast month, we shared that our partners can now use the new boolean field\nconnectedTelevisionOnly\nin Campaign API and Ad Supply Forecasts API to create and run Connected TV (CTV) video ad campaigns. LinkedIn Connected TV (CTV) ads help your customers reach their audience on a large-screen experience, using first-party data from our community of one billion professionals.Starting with the 202409 version, we are extending the brand safety capabilities for CTV via Publisher Lists. We have introduced a new field\npublisherListType\nin the request body schema forPOST /globalPublisherList\nto specifyCONNECTED_TELEVISION\nas a separate category fromWEB_AND_APP\nfor the type of publisher list to be downloaded. This enables your customers to download the list of Connected TV apps directly in your UI and access information such as Bundle ID, Publisher Name, Platform URL (when available), and IAB Categories.Please note, this new capability is available in addition to the following features for LAN that are available for CTV by default. Read more about the definitions and different use cases of these lists here.\n- Creating and uploading a blocklist or allowlist\n- Applying a blocklist or allowlist\n- Applying IAB categories\nMedia Planning API: Forecast CTV Campaign Delivery\nPartners now have access to a new capability in LinkedInâs Media Planning API to forecast CTV-only campaign delivery. You can add an optional\nctvOnly\nfield in the API request to forecast CTV-only campaigns in your media plans.Conversions API: Auto-campaign Association:\nA new field\nautoAssociateCampaigns\nhas been added to the request query parameters for POST /conversions. This field enables automatic association of all ACTIVE, PAUSED, and DRAFT campaigns with a conversion rule, ensuring only these associated campaigns are considered for reporting and optimization.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202306 - Dec 16, 2024\n- 202307 - Dec 16, 2024\n- 202308 - Aug 16, 2024\n- 202309 - Sep 16, 2024\n- 202310 - Oct 15, 2024\n- 202311 - Nov 15, 2024\nReminders\nOffline Conversions API Sunset:\nLast October, we launched the Conversions API, allowing our partners and customers to seamlessly connect both online and offline conversions directly to LinkedIn, replacing the legacy Offline Conversions API. If you are still integrated with the legacy Offline Conversions API, please migrate to the new Conversions API before October 15, 2024.AdCampaignRecommendation API Sunset:\nThe AdCampaignRecommendation API endpoint was deprecated in July 2023 and has been sunset with no alternative endpoint. Please note any future calls to this API will return an error.\nAugust 2024 - Version 202408\nProduct & Platform Announcements\nCampaign API and Ad Supply Forecasts API: Connected TV (CTV) Only Campaigns\nWe are excited to share that starting with the 202408 version, we have introduced a new boolean fieldconnectedTelevisionOnly\nin the Campaign API and Ad Supply Forecasts. This new field enables the creation and delivery of Connected TV (CTV) video ad campaigns. LinkedIn Connected TV (CTV) ads help your customers reach their audience on a large-screen experience using first-party data from our community of one billion professionals. CTV campaign metrics are identical to existing video campaign metrics.Please note the requirements below and check out our recommendations to make the most out of LinkedIn CTV campaigns here.\n- Ad Format: Video only\n- LinkedIn Placement: LAN (LinkedIn Audience Network)\n- Campaign Objective: Brand Awareness\n- Geo Eligibility: US & Canada\n- Language: English only\nCampaign API: Frequency Cap Customization\nYou can now use a new fieldoptimizationPreference\nin the Campaign API to set a maximum campaign-level frequency to better manage reach and frequency outcomes. Frequency is defined as the number of times an ad is served to a LinkedIn member over a specific time period. Research has shown that frequency is a key factor in improving brand awareness from advertising campaigns and positively influences ad recall and purchase intent.With this new frequency control, you can set a maximum frequency value between 3 to 30 within a 7-day window. This capability is available for CTV campaigns with the brand awareness objective and is accessible via a limited beta for LinkedIn Feed and LAN (LinkedIn Audience Network) campaigns.\nConversions API: Deprecating MQL and SQL Conversion Types\nStarting with the 202408 version, we will no longer supportMARKETING_QUALIFIED_LEAD\nandSALES_QUALIFIED_LEAD\nconversion types when creating a new conversion rule. We recommend usingQUALIFIED_LEAD\nas the conversion type, which has been available since version 202405.\nBreaking Changes\nThe monthly API versions listed below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched(202308) today. For more information on the latest version, see here.\n- 202306 - Dec 16, 2024\n- 202307 - Dec 16, 2024\n- 202308 - Aug 16, 2024\n- 202309 - Sep 16, 2024\n- 202310 - Oct 15, 2024\n- 202311 - Nov 15, 2024\nReminders\nAdAnalytics API: Reporting Changes to In-Feed Video & Sponsored Messaging\nStarting in July, we enhanced our measurement methodology for Video and Sponsored Messaging campaigns on LinkedIn.com and the LinkedIn mobile app to align more closely with industry standards. As a result, you may observe changes in your overall campaign reports.Video Campaigns Video ads that serve on LinkedIn.com and in the LinkedIn mobile app now report impressions and clicks only when they start to play. This may lead to a decrease in Video ad impressions, clicks, and CTRs reported for your customer campaigns, and CPMs, CPCs, and Video View Rates may increase. These changes apply to videos that run on LinkedIn feed only; campaigns utilizing LAN/CTV are not impacted.\nSponsored Messaging Impressions, clicks, and related metrics (such as CPM and CPC) from Sponsored Messaging campaigns are no longer reported. However, historical data from your customer campaigns delivered before late July is not impacted. You can continue to review sends and opens metrics under the âsendsâ and âopensâ columns, respectively. We recommend that you utilize sends and opens metrics moving forward versus the historical data for impressions, clicks, and derived metrics.\nJuly 2024 - Version 202407\nProduct & Platform Announcements\nAdAnalytics API: Reporting changes to In-Feed Video & Sponsored Messaging\nAt LinkedIn, we are committed to delivering measurement solutions that meet or exceed industry standards. We are pleased to share that we have improved our measurement methodology for Video and Sponsored Messaging campaigns that serve on LinkedIn.com and in the LinkedIn mobile app to better align with the industry standards. Due to these changes you may see a change in your holistic campaign reports.Video Campaigns\nBeginning July 11, Video ads that serve on LinkedIn.com and in the LinkedIn mobile app will begin reporting impressions and clicks only when they begin to play. This may result in a decrease of Video ad impressions, clicks, and CTRs reported for your customer campaigns, and CPMs, CPCs and Video View Rates may increase. These changes apply to videos that run on LinkedIn feed only, campaigns utilizing LAN/CTV will not be impacted.Sponsored Messaging\nStarting July 30, impressions, clicks, and related metrics (such as CPM and CPC) for Sponsored Messaging campaigns will no longer be reported. Historical data from campaigns prior to late July 2024 will remain unaffected. You can still access sends and opens metrics under the \"sends\" and \"opens\" columns, respectively. We recommend using sends and opens metrics for future analysis instead of relying on historical data for impressions, clicks, and derived metrics.AdAnalytics API: New metrics available for Sponsored Newsletter Articles\nWe are introducing two new metrics to the API:subscriptionClicks\nandviralSubscriptionClicks\n. ThesubscriptionClicks\nmetric measures the number of members whose first click on the ad in the feed is the Subscribe button. Any clicks on +Subscribe on subsequent pages, for example, the newsletter article page or the newsletter landing page, arenât counted as part of this metric. TheviralSubscriptionClicks\nmetric measures the number of members whose first click on the post is the Subscribe button that resulted from other members sharing a sponsored newsletter article with their network.Matched Audiences API and Conversions API: Email hashing guideline\nTo ensure the best audience match rates the following guidelines must be followed for email hashing:- Convert all the email addresses to lowercase before hashing\n- Remove any whitespace in the email address and then generate appropriate hash\nLeadgen Forms: Ability to apply custom Images\nWe have introduced an enhancement to Leadgen Forms that allows advertisers to personalize their Leadgen Form backgrounds with custom images (for sponsored content only), instead of the form automatically defaulting to the ad image. However, please note that at the time of the initial rollout, partners or advertisers will not be able to edit custom images via API. If you would like to explore or leverage this new feature, we recommend utilizing LinkedIn Campaign Manager to create and edit your Leadgen Forms and offer a more tailored experience for your target audience.AdCampaignGroups API: Objective Type for Campaign Group\nCampaign groups may now be created with objective type. If created with an objective type, then all campaigns in the group will share the same objective type. This field is optional and immutable once created.Engagement Retargeting API: New engagement source types\nWe are introducing the ability to build retargeting audiences based on their engagement with the Document and Conversation ad formats. Once an engagement rule is created, these audiences will refresh automatically based on the trigger and time frame selected. Advertisers can use audience retargeting to stay top of mind and move their target audiences through the funnel.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today. For more information on the latest version, see here.\n- 202308 - Aug 16, 2024\n- 202309 - Sep 16, 2024\n- 202310 - Oct 15, 2024\nReminders\n- AdAnalytics API: Reminder to switch to approximateMemberReach field\nAs communicated in January 2024,approximateUniqueImpressions\nfield has been deprecated and is replaced by the new API fieldapproximateMemberReach\n. If you are still utilizing the old field, please note that we will be updating theapproximateUniqueImpressions\nmeasurement methodology to align more closely with approximateMemberReach. When this transition takes place in July, you may notice a change in the approximateUniqueImpressions field and we recommend that you switch to approximateMemberReach as soon as possible.\nJune 2024 - Version 202406\nProduct & Platform Announcements\n- DMP Segments API: Field Removal\nWe have removed the\naccessPolicy\nfield due to low usage. Please note that including this in your create or update requests will fail and the field will no longer be returned in the response from READs (e.g. GET, BATCH_GET, FINDER).\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202306 - December 16, 2024\n- 202307 - Dec 16, 2024\n- 202308 - Aug 16, 2024\n- 202309 - Sep 16, 2024\nReminders\n- Changes to Member Groupsâ Targeting in the EEA and Switzerland As part of our ongoing efforts to provide a safe and trusted platform for members, we disabled Member Groupsâ targeting within the European Economic Area (EEA) and Switzerland (CH) as of May 15, 2024. Our global advertising policies do not allow targeting sensitive groups on our platform, and this change further helps protect LinkedIn members, customers, and partners, as well as clarify LinkedIn's compliance with applicable laws in the region.\nAs a reminder, if you have created campaigns before May 15 that target the EEA or CH using Member Groupsâ targeting, they will continue to deliver unless you make any edits. However, you will not be able to use this targeting facet for new campaigns targeting members residing in these regions. If your campaigns only target countries/regions outside the EEA and Switzerland, you are not impacted by this change.\nThere are multiple ways advertisers can reach their desired audiences on LinkedIn and meet their marketing goals. We encourage you to review our targeting best practices to learn more about optimizing your campaigns.\nMay 2024 - Version 202405\nProduct & Platform Announcements\n- Changes to Member Groupsâ targeting in the EEA and Switzerland starting May 15, 2024\nAs part of our ongoing efforts to provide a safe and trusted platform for members, we have decided to disable Member Groupsâ targeting within the European Economic Area (EEA) and Switzerland (CH). We have global advertising policies in place that do not allow targeting sensitive groups on our platform. This decision helps protect LinkedIn members, customers, and partners as well as clarify LinkedIn's compliance with applicable laws in the region.\nStarting May 15, 2024, you may experience changes in the LinkedIn campaign creation process if you run campaigns targeting members residing in the European Economic Area (EEA) and Switzerland (CH). Please review the following to understand how this change impacts your customer campaigns:\n| Campaigns | Description |\n|---|---|\n| Campaigns created before May 15 that target the EEA or CH AND Member Groups | - Campaigns will continue to deliver and edits can continue to be made. - On or after May 15: Edits to these campaigns will require the removal of Member Groups or EEA & CH targeting to be able to save and activate. |\n| Campaigns created on or after May 15 that target the EEA or CH | Member Groupsâ targeting will no longer be available. |\nIf campaigns only target countries/regions outside the EEA and Switzerland, these changes do not apply. There are multiple ways advertisers can reach their desired audiences on LinkedIn and meet their marketing goals. We encourage you to review our targeting best practices to learn more.\nConversions API: New Conversion Type\nPartners can access a new conversion type that has been added for creating conversion rules:QUALIFIED_LEAD\nwith LinkedInâs Conversions API.-\nReporting for Connected TV Ads\nWe have introducedCONNECTED_TV\nas an additional value supported on theIMPRESSION_DEVICE_TYPE\npivot for both the analytics finder and the statistics finder. When this pivot is used, ad performance metrics will be grouped by the device type the ad made an impression on, such asDESKTOP_WEB\n,MOBILE_WEB\n,MOBILE_APP\n,CONNECTED_TV\n, and UNDETECTED. Learn more about the reporting by impression device type in Campaign Manager here.Reporting for New Qualified Leads Conversion Rule\nWe have introduced new metricsqualifiedLeads\nandcostPerQualifiedLead\nto the statistics finder. ThequalifiedLeads\nmetric will show the total count of qualified leads attributed to the entities in the given time range andcostPerQualifiedLead\nwill return the number of qualified leads divided by spend. Partners can now submit this new conversion rule,QUALIFIED_LEAD\n, through the Conversions API as noted above.\nMedia Planning API: Forecast Lead Generation\nPartners now have access to a new capability in LinkedInâs Media Planning API to forecast lead generation. With a deeper insight into forecasted leads you can now plan and launch more effective campaigns on LinkedIn. With this release version, we now also support negative targeting(exclude section) in our Media Planning targeting input. Get started today.Creatives API & Legacy Creatives API: Updates to Ad Creative Rejection Reasons\nThe description for a few existing rejection reasons have been updated along with a new rejection reason symbol, which could be returned as rejection reasons from the API:MISSING_UK_FCA_FINANCIAL\n.Campaign API: Updates to the Brand Safety Feature\nThe publisher blocklists and allowlists under the Brand Safety feature have been updated to include a validation logic to prevent incorrect application of blocklists and allowlists during the campaign creation or update process. For example, allowlists can only be applied as an allowlist. Read more about the definitions and different use cases of these lists here.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched today.\n- 202306 - December 16, 2024\n- 202307 - December 16, 2024\n- 202308 - Aug 16, 2024\nReminders\nAdAccounts, Campaign Groups, Campaigns, Creative API: Adopt cursor-based pagination by May 31, 2024 to improve scalability of our platform\nWe are moving from index-based to cursor-based pagination. You will need to use pageToken returned in the previous call to get to the next set of results, instead of accessing a random page using start and count.\n- Instead of start & count, pageToken and pageSize will be used for pagination.\n- PageSize will be used to specify the number of entities to be returned.\n- NextPageToken is an opaque string that will be returned in the metadata and it represents the last entity in the response. It can be used to fetch the next set of results by passing it in âpageTokenâ in the next api call.\n- Sorting will only be supported by ID. SortOrder will define the sorting order (Ascending/ Descending) of the results.\n- Totals will no longer be supported as a query parameter.\nApril 2024 - Version 202404\nProduct & Platform Announcements\nPosts API: Capability to Fetch Celebration Posts\nAPI partners can now fetch celebration content type posts by using the latest 202404 version. Learn more here.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate to the latest API version launched today.\n- 202305 - May 15, 2024\n- 202306 - December 16, 2024\n- 202307 - December 16, 2024\nReminders\nAdAccounts, Campaign Groups, Campaigns, Creative API: Adopt cursor-based pagination by May 31, 2024 to improve scalability of our platform\nWe are moving from index-based to cursor-based pagination. You will need to use pageToken returned in the previous call to get to the next set of results, instead of accessing a random page using start and count.\n- Instead of start & count, pageToken and pageSize will be used for pagination.\n- PageSize will be used to specify the number of entities to be returned.\n- NextPageToken is an opaque string that will be returned in the metadata and it represents the last entity in the response. It can be used to fetch the next set of results by passing it in âpageTokenâ in the next api call.\n- Sorting will only be supported by ID. SortOrder will define the sorting order (Ascending/ Descending) of the results.\n- Totals will no longer be supported as a query parameter.\nMigrate to the new Lead Sync API by December 16, 2024: Collect leads from ads, events, and other organic sources via a single API\nThe new Lead Sync API simplifies and enhances LinkedIn lead syncing capabilities by consolidating the legacy Ads Lead Sync and Events Lead Sync APIs into a single API. It provides the ability to collect leads from additional organic sources and offers customized form field mapping to ensure lead information gets mapped to the right system fields. If youâre integrated with any of the legacy APIs, you will automatically have access to the new API and will need to migrate to the new API using the migration guide before December 16, 2024 when versions 202306 and 202307 will sunset. See our YouTube video covering the high level requirements of the migration.\nMarch 2024 - Version 202403\nProduct & Platform Announcements\nMedia Planning API: Improve Campaign Results by Optimizing Audiences and Budgets\nLinkedInâs Media Planning API enables marketers to have a better understanding of investment delivery against valuable audiences and objectives. With a deeper insight into forecasted reach, impressions, and frequency by audience, along with the ability to compare reach & frequency across multiple channels and partners âyou can now plan and launch more successful campaigns on LinkedIn.â Get started today.\nCampaign Recommendations: Endpoints to be Deprecated\nThe adCampaignRecommendations\nand adCampaignInsights\nAPIs let advertisers determine if active LinkedIn campaigns are achieving the desired reach and impact. Starting 202403 these API endpoints will be deprecated but you can continue to use 202402 or earlier versions until it is sunset in a year.\nLeadGenNotificationSubscription API: New Associated Entity Type\nYou can now access a new field LeadGenNotificationAssociatedEntity to support LeadGenNotificationSubscription creation by campaign. This would allow advertisers to receive lead notifications at a campaign level.\nBreaking Changes\nThe monthly API versions below will be sunset and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched today.\n- 202304 - April 15, 2024\n- 202305 - May 15, 2024\n- 202306 - December 16, 2024\nReminders\nLinkedIn in Europe: Changes for the Digital Markets Act\nStarting in February, LinkedIn made changes for members in the EEA and Switzerland to comply with new requirements imposed on us by the Digital Markets Act (DMA). We are providing the ability for members in these regions to choose whether to connect their core LinkedIn experience with LinkedIn marketing products and services in order to better tailor their experiences to their professional interests. As this new experience ramps to members, your customers may notice changes in LinkedIn campaign performance. For example, if you use LinkedIn Reporting API, they may notice fewer conversions reported based on how we apply modeling to report conversions from members residing in the EEA and Switzerland. Or if they use certain targeting facets such as inferred targeting or retargeting from company Page visits and events, they may observe decreased audience sizes that could result in changes to ROI.\nThe changes you observe are a reflection of members in the EEA and Switzerland who have either not yet engaged with the new consent experience or have chosen not to connect their Marketing Solutions feature to their core LinkedIn experience. The impact is highly variable based on DMA consent rates, targeting usage & behaviors (e.g. AND vs OR, hyper targeting), budgets, and more. Read more about our approach to DMA here and how this may change our marketing solutions products and services here.\nAdAccounts, Campaign Groups, Campaigns, Creative API: Adopt cursor-based pagination by May 31, 2024 to improve scalability of our platform\nWe are moving from index-based to cursor-based pagination. You will need to use pageToken returned in the previous call to get to the next set of results, instead of accessing a random page using start and count.\n- Instead of start & count, pageToken and pageSize will be used for pagination.\n- PageSize will be used to specify the number of entities to be returned.\n- NextPageToken is an opaque string that will be returned in the metadata and it represents the last entity in the response. It can be used to fetch the next set of results by passing it in âpageTokenâ in the next api call.\n- Sorting will only be supported by ID. SortOrder will define the sorting order (Ascending/ Descending) of the results.\n- Totals will no longer be supported as a query parameter.\nFebruary 2024 - Version 202402\nProduct & Platform Announcements\nConversions API (CAPI): Attribute LinkedIn campaigns to business outcomes Help your customers navigate measurement uncertainty and impending cookie deprecation with a solution designed to improve full funnel measurement and unlock optimization by connecting online and offline conversions to LinkedIn and using those insights to power campaign optimization. Explore CAPI benefits.\nNew Lead Sync API: Collect more leads The Lead Sync API is easier to access than ever before and includes both organic and paid leads in a single API to help your customers collect leads from more LinkedIn sources. Check out what you can do with the new API.\nBreaking Changes\nThe monthly API versions below will be deprecated and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched today.\n- 202303 - March 15, 2024\n- 202304 - April 15, 2024\n- 202305 - May 15, 2024\nReminders\nAdAccounts, Campaign Groups, Campaigns, Creative API: Adopt cursor-based pagination by May 31, 2024 to improve scalability of our platform We are moving from index-based to cursor-based pagination. You will need to use pageToken returned in the previous call to get to the next set of results, instead of accessing a random page using start and count.\n- Instead of start & count, pageToken and pageSize will be used for pagination.\n- PageSize will be used to specify the number of entities to be returned.\n- NextPageToken is an opaque string which will be returned in the metadata and it represents the last entity in the response. It can be used to fetch the next set of results by passing it in âpageTokenâ in the next api call.\n- Sorting will only be supported by id. SortOrder will define the sorting order (Ascending/ Descending) of the results.\n- Totals will no longer be supported as a query parameter.\nLookalike Audiences API: Sunset on February 29 On February 29, 2024, we will sunset the ability to create new Lookalike Audiences in both Campaign Manager and via API, as we evolve our audience solutions and invest in new solutions to help scale marketersâ first- and third-party data. Existing Lookalike Audiences can still be used in campaigns but will not be updated when the seed audience updates. Additionally, the following changes will impact existing audiences:\n- If the LaL audience is not used in a draft or active campaign for 30 days, it will be ARCHIVED.\n- If an LaL audience is ARCHIVED but added to a draft or active campaign, it will go back to BUILDING but it will not be regenerated. It will reflect the original state of the LaL as it was prior to February 29.\n- If an ARCHIVED LaL audience is EXPIRED, it is purged and can never be used again.\nMigrate to the new Lead Sync API: Collect leads from ads, events, and other organic sources via a single API The Ads Lead Sync and Events Lead Sync APIs will be deprecated and replaced with the new Lead Sync API. If youâre integrated with any of the legacy APIs, you will automatically have access to the new API and will need to migrate to the new API using the migration guide before July 2024 when version 202307 sunsets. See our YouTube video covering the high level requirements of the migration.\nJanuary 2024 - Version 202401\nProduct & Platform Announcements\nAdAccounts, Campaign Groups, Campaigns, Creative API: Adopt cursor-based pagination by May 31, 2024\nWe are moving from index-based to cursor-based pagination. You must use pageToken\nreturned in the previous call to get to the next set of results, instead of accessing a random page using start and count.\n- Instead of start & count, pageToken and pageSize will be used for pagination.\n- PageSize will be used to specify the number of entities to be returned.\n- NextPageToken is an opaque string which will be returned in the metadata and it represents the last entity in the response. It can be used to fetch the next set of results by passing it in âpageTokenâ in the next API call.\n- Sorting will only be supported by ID.\nSortOrder\nwill define the sorting order (Ascending/ Descending) of the results. - Totals will no longer be supported as a query parameter.\n- We will soon sunset index-based pagination from all API versions prior to 2024, so you need to migrate to any 2024 API version before then.\nAd Preview API: Migrate to Latest Version\nOn February 29, 2024 we will sunset ads preview from all API versions before 202311. To continue to support ads preview, make sure to migrate to the latest version.\nAd Analytics API: Upcoming Reach Metric Changes\nStarting in January 2024, approximateUniqueImpressions\nwill be deprecated and the new API field will be called approximateMemberReach\n. As we move to a new metric measurement methodology, you may see some deviation between upcoming approximateMemberReach\nand old approximateUniqueImpressions\nfor the same creative/campaign/campaign group with the same date range. Additionally, we will be restricting the availability of approximateMemberReach\nmetrics in the following ways:\napproximateMemberReach\nwill only be supported with pivot(s): CREATIVE, CAMPAIGN, CAMPAIGN_GROUP, CAMPAIGN_TYPE, OBJECTIVE_TYPE and/or SERVING_LOCATION. All requests which supply additional pivot(s) will not includeapproximateMemberReach\nin the response.approximateMemberReach\ncan be requested for date ranges with a maximum range of 92 days.approximateMemberReach\nwill not be available for the current UTC day. The expected delay for current UTC day will be 24-48 hours. Requests which include today in the date range will only return reach for days where data exists.\nPage Statistics API: Improving location standardization for professional demographic analytics\nWe will replace the Page professional demographic breakdown by legacy geo region and country/region with the Bing Geo market area and country/region. This will provide more accurate and comprehensive geographical data. As a result, pageStatisticsByRegion\nand pageStatisticsByCountry\nwill be replaced with pageStatisticsByGeo\nand pageStatisticsByGeoCountry\n.\nCreatives API & Legacy Creatives API: Updates to Ad Creative Rejection Reasons\n- We have added a new rejection reason symbol, which could be returned as rejection reasons from the API: MISINFORMATION\n- We have updated the description for below existing rejection reasons\n- PRESCRIPTION_DRUGS\n- OVER_THE_COUNTER_DRUGS\n- MEDICAL_DEVICES_AND_TREATMENTS\n- ILLICIT_OR_RECREATIONAL_DRUGS_AND_RELATED_PRODUCTS\n- LEGITSCRIPT_APPROVAL_MISSING\n- PHARMACY_AND_TELEHEALTH\nLookalike Audiences API: Sunset on February 29\nOn February 29, 2024, we will sunset the ability to create new Lookalike Audiences in both Campaign Manager and via API, as we evolve our audience solutions and invest in new solutions to help scale marketersâ first- and third-party data. Existing Lookalike Audiences can still be used in campaigns but will not be updated when the seed audience updates. Additionally, the following changes will impact existing audiences:\n- If the LaL audience is not used in a draft or active campaign for 30 days, it will be ARCHIVED.\n- If an LaL audience is ARCHIVED but added to a draft or active campaign, it will go back to BUILDING but it will not be regenerated. It will reflect the original state of the LaL as it was prior to February 29.\n- If an ARCHIVED LaL audience is EXPIRED, it is purged and can not be reused.\nBreaking Changes\nThe monthly API versions below will be deprecated and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched.\n- 202302 - February 15, 2024\n- 202303 - March 15, 2024\n- 202304 - April 15, 2024\nReminders\nMigrate to the new Lead Sync API: Collect leads from ads, events, and other organic sources via a single API\nThe Ads Lead Sync and Events Lead Sync APIs will be deprecated and replaced with the new Lead Sync API. If youâre integrated with any of the legacy APIs, you will automatically have access to the new API and will need to migrate to the new API using the migration guide before July 2024 when version 202307 sunsets. See our YouTube video covering the high-level requirements of the migration.\nNovember 2023 - Version 202311\nProduct & Platform Announcements\nAd Preview API: Ad account URN required to generate creative preview. Starting with the 202311 version, you need to pass the Creative URN and Ad account URN to generate a preview of the creative in your platform.\nOffline Conversion API: Sunsetting Offline Conversions. In October 2023, we launched the Conversions API, which connects both online and offline conversions directly to LinkedIn, and replaces the Offline Conversions API. If you have integrated with Offline Conversions API, migrate to the new Conversions API before October 2024.\nBrand Lift Testing API: New question type is now available. You can now use a new brand lift metric âTop-of-mind Awarenessâ, for example \"What [brand / product / service / employer] comes to mind when you think of [user input]?\", in Brand Lift Testing to prove how your brand efforts are moving the needle to keep your brand top of mind.\nBreaking Changes\nThe monthly API versions below will be deprecated and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched today.\n- 202212 - December 15, 2023\n- 202301 - January 15, 2024\n- 202302 - February 15, 2024\nOctober 2023 - Version 202310\nDocumentation Changes\nNew Marketing APIs Landing Page: A brand new landing page has been added to the Marketing APIs section that provides a detailed view of the API products offered with a fresh look and feel.\nProduct & Platform Announcements\nConversions API: Build a server-to-server integration to strengthen both performance and privacy.\nLeverage LinkedIn's Conversions API to build a solution that connects marketing data, like online and offline conversions, directly to LinkedIn. Conversions API enables full-funnel measurement and powers campaign optimization while providing a secure, reliable data connection. Get started by reviewing the prerequisites and application process here.\nCreatives API: New call to action types\nWe've expanded the call to action types for a lead generation form creative to include: JOIN, SIGNUP, REQUEST DEMO.\nBreaking Changes\nThe monthly API versions below will be deprecated and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched today.\n- 202211 - November 15, 2023\n- 202212 - December 15, 2023\n- 202301 - January 15, 2024\nSeptember 2023 - Version 202309\nBreaking Changes\nThe monthly API versions below will be deprecated and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version (202309) launched today.\n- 202210 to be deprecated on October 16, 2023\n- 202211 to be deprecated on November 15, 2023\n- 202212 to be deprecated on December 15, 2023.\nSee Versioning Guide for more.\nAugust 2023 - Version 202308\nProduct & Platform Announcements\nConversation Ads API: Add subject to a Conversation Ad\nYou can now add a subject to a Conversion Ad which will appear as the first line in the memberâs inbox. Previously it was auto populated with the first conversation message.mediaArtifactPublicUrls API: API is deprecated\nAdditional fields have been added to Assets API to support the mediaArtifactPublicUrls use case.Creatives API & Legacy Creatives API: Updates to Ad Creative Rejection Reasons\nWe have added six new rejection reason symbols, which could be returned as rejection reasons from the API:\nILLICIT_OR_RECREATIONAL_DRUGS_AND_RELATED_PRODUCTS\nLEGITSCRIPT_APPROVAL_MISSING\nMEDICAL_DEVICES_AND_TREATMENTS\nOVER_THE_COUNTER_DRUGS\nPHARMACY_AND_TELEHEALTH\nPRESCRIPTION_DRUGS\nWe have updated the description of the\nHEALTH_MATTERS\nsymbol explaining the current policy for rejecting Ads with this reason.\nBreaking Changes\nThe monthly API versions below will be deprecated and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched today.\n- 202209 - September 15, 2023\n- 202210 - October 16, 2023\n- 202211 - November 15, 2023\nStarting with the 202307 version, API decoration will not be supported for any API. Weâve created this video to assist you with this change.\nReminders\nMessage Ads to be sunset on August 31, 2023 On August 31, 2023, we will be sunsetting Message Ads and recommend switching to Conversation Ads. The ability to create a Message Ad will be sunset across all API versions. Delivery for existing Message Ads campaigns will be reduced, and we recommend notifying your clients to stop creating new Message Ads.\nJuly 2023 - Version 202307\nProduct & Platform Announcements\n- Post API: More images allowed in multi-image posts.\nWe have increased the max number of images you can include in a multi-image post from 9 to 20. To know more, go to Post API page.\n- Comments API: Update to $URN field and digitalmediaAsset field\nWe have replaced the following:\n- $URN\nfield with the id\nfield.\n- digitalmediaAsset\nfield with the image\nfield. To know more, go to Comments API page.\n- Reactions API: Updates to MAYBE reaction and $URN field.\nThe following updates are made to the Reactions API:\n- The MAYBE\nreaction is no longer supported. Any write with the MAYBE\nreaction will be rejected with a 400 error.\n- The $URN\nfield is replaced with the id\nfield.\nNew Lead Sync API: Collect leads from ads, events, and other future marketing cases via a single API\nThe Ads Lead Sync and Events Lead Sync APIs will be deprecated and replaced with the new Lead Sync API. If youâre integrated with any of the legacy APIs, you will automatically have access to the new API and will need to migrate to the new API using the migration guide before July 2024 when version 202307 sunsets. If youâre interested in accessing the new API for the first time, learn about the qualifications, and application steps here.Creatives API and the Legacy Creatives API: Updates to Ad Creative Rejection Reasons\nWe have added six new rejection reason symbols, which could be returned as rejection reasons from the API:\n- ILLICIT_OR_RECREATIONAL_DRUGS_AND_RELATED_PRODUCTS\n- LEGITSCRIPT_APPROVAL_MISSING\n- MEDICAL_DEVICES_AND_TREATMENTS\n- OVER_THE_COUNTER_DRUGS\n- PHARMACY_AND_TELEHEALTH\n- PRESCRIPTION_DRUGS\nWe have updated the description of the HEALTH_MATTERS\nsymbol explaining the current policy for rejecting Ads with this reason.\n- Engagement Retargeting API: Update to timeFrame field\nThe timeFrame\nfield will accept timeSpan\ninstead of com.linkedin.common.timeSpan\n.\nAPI Deprecations Starting with version 202307:\n- The countries, countryGroup, places, regions, and states APIs are deprecated and should be replaced with the geo API.\n- The companies API is deprecated and should be replaced with the Organizations API.\n- OrganizationBrandLookup API is deprecated and should be replaced with the OrganizationLookup API.\n- The adCampaign Recommendation API is deprecated and not being replaced by another API.\n- The /adInMailContents API is deprecated and should be replaced with the /inMailContents API.\nBreaking Changes\nThe monthly API versions below will be deprecated and removed from the platform on the dates listed. To avoid disruptions to your platform, please migrate the latest API version launched today.\n- 202207 - July 25, 2023\n- 202208 - August 15, 2023\n- 202209 - September 15, 2023\nStarting with the 202307 version, API decoration will not be supported for any API. Weâve created this video to assist you with this change.\nReminders\n- Message Ads to be sunset on August 31, 2023\nOn August 31, 2023, we will be sunsetting Message Ads and recommend switching to Conversation Ads. The ability to create a Message Ad will be sunset across all API versions. Delivery for existing Message Ads campaigns will be reduced, and we recommend notifying your clients to stop creating new Message Ads.\nJune 2023 - Version 202306\nMigrations\nCritical API migrations must be completed by June 30, 2023.\nAPI Versioning and new Content APIs: We will sunset unversioned APIs and legacy Content APIs Shares API, UGC API on June 30, 2023. Migrate to versioned APIs and new Content APIs to avoid any disruptions.\nNew Community Management API*: We introduced a new Community Management API in January 2023 to offer more functionality to enable your customers to grow their professional communities. Apply and migrate to the new API to keep your community management integration active. Legacy community management permissions will sunset and be removed on June 30, 2023\nProduct & Platform Announcements\nAudience Insights API: Make it easier to plan and understand professional audiences We are introducing the Audience Insights API, which provides aggregated insights into the professional demographic and firmographic details, and interests of a target audience. These insights help you understand more about âwhoâ the audience is and can be leveraged to discover new audiences, plan & optimize your strategy, and build new audiences to seamlessly start your campaign. This is a private API and requires additional approval to access. Learn more on how to apply here.\nAd Analytics API: B2B query templates make it easy to get relevant reporting metrics\nTemplated, B2B-focused queries are now available via Postman collection to enable quick access to B2B-relevant metrics that can be used to build insightful reports and inform optimization. We are starting with 3 focused bundles - Performance Overview, ABM Performance Overview, Conversions Deep Dive - and will continue to evolve our templates library, so please take advantage and share feedback here for future updates.Response format change for thirdPartyTrackingTags API\nStarting with version 202306, we're making changes to the response format of the thirdPartyTrackingTags API. The GET and FINDER APIs will now returnchangeTimeStamps\ninstead ofchangeAuditStamps\nin their responses. The newchangeTimeStamps\nwill still include thecreated\n,lastUpdated\n, anddeleted\nfields, but they will now directly contain the timestamp value instead of being nested within another object with a time field.Query params changes: Enabling unwrapped query params\nWe previously announced that certain query params had to be wrapped - e.g. we required intendedStatuses=(value:List(ARCHIVED,CANCELED)) rather than intendedStatuses=List(ARCHIVED,CANCELED). Based on your feedback and to create a better experience, weâve decided to revert this decision and enable you to make requests without wrapping the query params. We will support both wrapped and unwrapped query params until the 202305 version. From 202306 onwards only unwrapped query params are allowed. The APIs that are affected by this change are: Ad Analytics API, Creatives API, Posts API, Saved Audience Template API, Videos API.\nBreaking Changes\n202207 version will be deprecated and removed from the platform on July 17, 2023. Be sure to update your apps to the latest version before then.\nMessage Ads will be sunset and removed across all versions starting August 31, 2023.\nStarting with the 202305 and 202306 versions, API decoration will not be supported for certain APIs. See the Recent Changes page in documentation for the complete list of impacted APIs. Weâve created this video to assist you with this change.\nFrom 202305:\n/adPageSets\n/adSegmentSources\n/adSegments\n/dmpSegments/{dmpSegmentId}/companies\n/dmpSegments/{dmpSegmentId}/destinations\n/dmpSegments/{dmpSegmentId}/lookalikes\n/dmpSegments\n/dmpSegments/{dmpSegmentId}/users\n/adAccounts/{id}/creatives\n/posts\n/adInMailContents\n/inMailContents\n/conversationAds\n/conversationAds/{conversationId}/sponsoredMessageContents\n/adAccounts/{id}/adCampaignGroups/\n/adAccounts/{id}/adCampaigns\n/adLiftTests\n/adLiftTests/{id}/adLiftTestSurveys\n/adSupplyForecasts\n/networkSizes\n/adPublisherRestrictions\n/videoAnalytics\n/brandPageStatistics\n/organizationAcls\n/organizationalEntityFollowerStatistics\n/organizationalEntityNotifications\n/organizationalEntityShareStatistics\n/organizationPageStatistics\n/organizationShareAuthorizations\n/adInMailMemberSenderPermissions\n/adBudgetPricing\n/documents\nFrom 202306:\n/shortlink\n/conversions\n/thirdPartyTrackingTags\n/socialActions/{target}/likes\n/socialActions\n/socialActions/{target}/comments\n/socialMetadata\n/assets\n/people\n/me\n/dmpEngagementSourceTypes\n/dmpEngagementSourceTypes/{engagementSourceType}/dmpEngagementTriggers\nReminders\nAccess and refresh token requests after June 30, 2023\nMake access token and refresh token requests using the POST method to /accessToken endpoint with the request headerâContent-Typeâ: âx-www-form-urlencodedâ\nand all required parameters in the request body. Using the GET /accessToken endpoint after June 30, 2023 will result in a 400 error.Message Ads to be sunset on August 31, 2023\nOn August 31, 2023, we will be sunsetting Message Ads and recommend switching to Conversation Ads. The ability to create a Message Ad will be sunset across all API versions. Delivery for new Message Ads campaigns will be reduced, and we recommend notifying your clients to stop creating new Message Ads.\nMay 2023 - Version 202305\nMigrations & Breaking Changes\n- Critical API migrations must be completed by June 30, 2023.\nPlease review details below for recent API enhancements that may impact your apps.- API versioning and new Content APIs*: Introduced in June 2022, these enhancements make it easy for you to build on our platform.\n- API versioning: Learn more and how to migrate from unversioned.\n- New Content APIs: Learn more and how to migrate from legacy APIs.\n- New Community Management API*: Introduced in Q4 2022, this API accelerates access to more functionality enabling your customers to know and grow their professional communities. Learn how to migrate to the new API as well as our plans for community management.\n- API versioning and new Content APIs*: Introduced in June 2022, these enhancements make it easy for you to build on our platform.\nIf you have impacted apps, please make the necessary changes immediately or set aside time/resources to complete updates before June 30th 2023.\nMigrate June 2022 versioned APIs to the latest version prior to June 15, 2023\nBeginning June 2022, we introduced monthly versioning of our APIs and committed to supporting each monthly version for 12 months. Applications using the 202206 version of any versioned APIs must migrate to the latest version before June 15, when we will release the June 2023 versions of our APIs.Reminder about access and refresh token requests after June 30, 2023\nAll access token and refresh token requests should be made using only the POST method to /accessToken endpoint with the request headerâContent-Typeâ: âx-www-form-urlencodedâ\nand all required parameters in the request body. We will start returning 400 errors on theGET /accessToken\nendpoint after June 30, 2023.Update to adCreativesV2 deco Starting May, all deco calls for creative URN will resolve via the /creatives endpoint instead of the /adCreativesV2 endpoint. Partners who use the adAnalytics endpoint and other endpoints that use deco calls to fetch creatives need to update their calls.\nMessage Ads API Weâre sunsetting Message Ads API starting May 22, 2023. New campaign creation will be disabled on June 19, 2023. We strongly encourage switching from the legacy Message Ads API to Conversation Ads API by June 19th to avoid disruption of campaign delivery.\nUpdates to Base URLs Starting with the 202305 version, all API calls to the following endpoints will be modified to include advertiser Account ID in the URL path:\n| Endpoint Changed | Previous Base URL | New Base URL |\n|---|---|---|\n| /adCampaignGroups | https://api.linkedin.com/rest/adCampaignGroups |\nhttps://api.linkedin.com/rest/adAccounts/{adAccountId}/adCampaignGroups |\n| /adCampaigns | https://api.linkedin.com/rest/adCampaigns |\nhttps://api.linkedin.com/rest/adAccounts/{adAccountId}/adCampaigns |\n| /creatives | https://api.linkedin.com/rest/creatives |\nhttps://api.linkedin.com/rest/adAccounts/{adAccountId}/creatives |\nWhat this means:\nFinder functionality will now be limited to a single account. Currently, we can search for campaign groups, campaigns and creatives across accounts using finders. Adding advertiser account ID to the URL would limit the ability to do this. Any calls from now on need to be made per account.\nIn addition, we will be removing the ability to filter by account predicate from campaign group, campaign and creative finders. As we are already limiting the finder functionality to a single account, it doesnât make sense to have it as a filter predicate. Similarly, we can no longer sort by Account field since the search results are being limited to an advertiser account.\nThe new URLs will be active from the May version. This means that all APIs using version header 202304 or earlier will need to call the old URLs. And all APIs using version headers 202305 or above will need to call the new API URLs.\nWith the new APIs, applications will always need to pass an advertiser account ID in the URL path.\n-\n- Deprecate API Decoration starting with the June 2023 version: Starting with the 202306 version, we will remove API Decoration from the Ad Analytics API. As an alternative, individual requests can be made to access the corresponding entity associated with a URN. More information can be found in URN Resolution. For eligible pivots of the Ad Analytics API, we are adding a note that indicates which type of URN will be returned for each pivot. For example, if the\nMEMBER_COMPANY\npivot is used with an analytics finder, then the response will contain a pivot value in the formaturn:li:organization:<organizationId>\n. - Remove support for\npivot\nandpivotValue\nfields: Starting with the 202305 version, we will no longer support thepivot\nandpivotValue\nfields in the returned entities of the Ad Analytics API. Requests with these fields in the field projections will be rejected. We will continue to supportpivotValues\n, which provides more accurate and comprehensive information about the values of the pivots requested.\n- Deprecate API Decoration starting with the June 2023 version: Starting with the 202306 version, we will remove API Decoration from the Ad Analytics API. As an alternative, individual requests can be made to access the corresponding entity associated with a URN. More information can be found in URN Resolution. For eligible pivots of the Ad Analytics API, we are adding a note that indicates which type of URN will be returned for each pivot. For example, if the\n- DMP Segments API: find by account requests without\nstart\norcount\nparameters are now paginated according to the standard pagination behavior. - DMP Segments Users API: The\nuserId\nfield has been sunset and replaced by theuserIds\nfield\nProduct & Platform Announcements\nContent API: Externalizing Document Ads In September 2022, we rolled out a new ad format, Document Ads, which allows advertisers to share ungated and gated documents, such as case studies, white papers, or research reports, directly in the LinkedIn feed. With Document Ads, target audiences can read or download documents without leaving the feed. Advertisers can choose to share their content freely to build awareness and grow thought leadership or gate their documents with a Lead Gen Form.\nDocument Ads API Prior to today, creating a Document Ad was only available to advertisers through Campaign Manager. The new Document Ads API allows advertisers to now have access to a new format during ad creation on partner platforms. To learn more, see the Document Ads API page.\nAd Analytics API: New metrics for Conversation Ads Weâre launching a new & improved version of Conversation Ads on May 22nd, with availability increasing over time. Alongside this product change, we will introduce two new reporting metrics for Conversation Ads - headlineImpressions and headlineCTR - to help you measure campaign performance for new & improved Conversation Ads. These new metrics will measure the number of times members are shown the headline of the Conversation Ad and the number of times members clicked on it to start a conversation. To learn more, see this article.\nApril 2023\nMigrations & Breaking Changes\n- Critical API migrations must be completed by June 30, 2023.\nPlease review details below for recent API enhancements that may impact your apps.\n- API versioning and new Content APIs: Introduced in June 2022, these enhancements make it easy for you to build on our platform.\n- API versioning: Learn more and how to migrate from unversioned.\n- New Content APIs: Learn more and how to migrate from legacy APIs.\n- New Community Management API: Introduced in Q4 2022, this API accelerates access to more functionality enabling your customers to know and grow their professional communities. Learn how to migrate to the new API as well as our plans for community management.\nIf you have impacted apps, please make the necessary changes immediately or set aside time/resources to complete updates before June 30th 2023.\nMigrate June 2022 versioned APIs to the latest version prior to June 15, 2023\nBeginning June 2022, we introduced monthly versioning of our APIs and committed to supporting each monthly version for 12 months. Applications using the 202206 version of any versioned APIs must migrate to the latest version before June 15, when we will release the June 2023 versions of our APIs.Reminder about access and refresh token requests after June 30, 2023\nAll access token and refresh token requests should be made using only the POST method to /accessToken endpoint with the request headerâContent-Typeâ: âx-www-form-urlencodedâ\nand all required parameters in the request body. We will start returning 400 errors on theGET /accessToken\nendpoint after June 30, 2023.Ad Segments API: find by account requests without\nstart\norcount\nparameters are now paginated according to the standard pagination behavior.\nSchema changes\nAd Targeting, Ad Targeting Entities API: Starting with the 202304 version, we're changing the format of certain query parameters in the adTargetingFacet finder, the similarEntities finder, the typeahead finder and the urns finder. In the finders,\nentityType\n,queryVersion\n, andfetchType\nwould be records containing the expected values instead of directly accepting values. For example,entityType=SENIORITY\nwould becomeentityType=(value:SENIORITY)\n.Ad Targeting, Ad Targeting Facets API: Starting with the 202304 version, we're changing the\n$URN\nfield of type urn in theGET_ALL\nmethod toadTargetingFacetUrn\nof typeAdTargetingFacetUrn\n.\nDeco Updates\nDeprecation of API Decoration In November 2022, we began deprecating API decoration for some APIs. Starting with the 202303 version, we no longer support decoration on the following additional APIs:\n- Ad Targeting Entities API -\n/adTargetingEntities\n- Ad Targeting Facets API -\n/adTargetingFacets\n- VideoAnalytics API -\n/videoAnalytics\n- Ad Segments API -\n/adSegments\n- Network Sizes API -\n/networkSizes\n- Ad Supply Forecasts API -\n/adSupplyForecasts\n- Ad Publisher Restrictions API -\n/adPublisherRestrictions\n- eventSubscriptions API -\n/eventSubscriptions\n- DMP Segment Lookalike API-\n/dmpSegments/lookalikes\n- Vanity URL API -\n/vanityUrl\n- People Typeahead API -\n/peopleTypeahead\n- CampaignConversions API -\n/campaignConversions\n- Audience Restrictions API -\n/adPublisherRestrictions\n,/iabCategories\nBe sure to watch our helpful video on how to handle this change.\n- Ad Targeting Entities API -\nUpdate to\nadCreativesV2\nfor deco Starting May, all deco calls for creative URN are resolving via the/creatives\nendpoint instead of the/adCreativesV2\nendpoint. Partners who use the adAnalytics endpoint and other endpoints that use deco calls to fetch creatives need to update their calls. All access and refresh token requests should only be made using the POST method after June 30,2023.\nProduct & Platform Announcements\nImages API & Videos API: Beginning with the 202304 release, we are removing a role check for company URN owners and member URN owners when retrieving an image and/or video. For partners using a combination of /posts and /images or /videos, if /post API viewability checks are satisfied (e.g. you need to own the post as a member or company admin or be a role in AdAccount) you will be able to access images through /images and videos through /video.\n-\n- Introducing IMPRESSION_DEVICE_TYPE pivot: Starting with the 202304 version, we are introducing the\nIMPRESSION_DEVICE_TYPE\npivot for both the statistics finder and the analytics finder. When this pivot is used, the results will be grouped by the device type the ad made an impression on, such asMOBILE_APP\nandDESKTOP_WEB\n. - Deprecate API Decoration starting from the June 2023 version: Starting with the 202306 version, we are removing API Decoration from the Ad Analytics API. As an alternative, individual requests can be made to access the corresponding entity associated with a URN. More information can be found in LinkedIn Marketing API URN Resolution. For eligible pivots of the Ad Analytics API, we are adding a note that indicates which type of URN will be returned for each pivot. For example, if the MEMBER_COMPANY pivot is used with an analytics finder, then the response will contain a pivot value in the format\nurn:li:organization: <organizationId>\n- Introducing IMPRESSION_DEVICE_TYPE pivot: Starting with the 202304 version, we are introducing the\nAd Publisher Restrictions API: Externalizing the type field Starting with the 202304 version, we are introducing a new field\ntype\n. This field can be used to create allowlist by passing type as ALLOWLIST in create method. This is an optional field having a default value as BLOCKLIST for backward compatibility since in earlier versions we supported only creation of BLOCKLIST from API. For example,âtypeâ: âALLOWLISTâ\ncan be used to create allowlist.New training videos To support our developer community, we've started to produce training videos on topics we think you'll find helpful. Our first two cover:\n- Best practices when working with our API support team\n- How to handle deprecation of API decoration (see related post in the Migrations & Breaking Changes section above for link)\nMarch 2023\nProduct & Platform Announcements\nAd Analytics API: Introducing validWorkEmailLeads metric and PLACEMENT_NAME pivot Starting with the 202303 version, we are introducing the following:\n- validWorkEmailLeads: This metric represents the count of leads with a valid work email that does not use an established free or personal email domain.\n- PLACEMENT_NAME: This pivot enables grouping of metrics by placement. The pivot values are:\nLINKEDIN\n,OFFSITE\nandOFFSITE_IN_STREAM\n. Only LAN(Linkedin Audience Network) enabled video campaigns are eligible to deliver on offsite in-stream inventory. When video campaigns deliver on offsite in-stream inventory, you will see the metrics available for \"OFFSITE_IN_STREAM\" placement.\nImage API & Videos API: Externalizing the Media Library In October 2022, we rolled out the media library in the Campaign Manager UI. The media library provides one location where advertisers can upload, manage, and select images and videos for single image ads and video ads. We are externalizing the media library for our API partners so that advertisers can use the same media library during ad creation on partner platforms.\nThis will allow API partners to perform the following actions:\ninitializeUpload\n(existing method): This is an existing method for asset upload; the update in the release would be parallel registration under the Media LibraryfindByAssociatedAccount\n(new method): Return all media library assets under a specific account and asset typepartialUpdate\n(new method): Update an existing media library asset- specifically to rename an asset or to archive itWe will enable\nfindByIdsAndAssociatedAccount\nto return specific media library assets based on ID in a future release.\nSaved Audience Template API: Save Audience Criteria\nWe are introducing a new API to enable the following:Save audiences, including targeting attributes and/or existing matched audiences, for easy re-use in campaigns. This is especially valuable for users who build audiences via the Audience Insights and wish to apply those audiences to a campaign.\nFetch audiences to access audience insights when used in tandem with the Audience Insights saved via the Campaign Manager UI.\nAds A/B Testing API: Test Campaign Performance\nWe have launched A/B Testing to help our advertisers optimize their ROI with rigorous testing. A/B Testing measures the performance of two campaigns with equal audiences and budgets to test one variable, such as creative content / ad format, targeting, or placement. The testing tool then selects a winner (if any), or verifies that the performance difference between the variants is insignificant or inconclusive.\nBreaking Changes\n- Ad Analytics API: Change in structure of query parameters**\nStarting with the 202303 version, we will change the format of certain query parameters in both the analytics finder and the statistics finder. In both finders, pivot\n, pivots\n, timeGranularity\n, campaignType\n, and objectiveType\nwould be records containing the expected values instead of directly accepting values. For example, pivot=CAMPAIGN would become pivots=(value:List(CREATIVE,CAMPAIGN))\nwould become pivots=List((value:CREATIVE),(value:CAMPAIGN))\n.\nCreatives API: Change in the structure of IntendedStatuses finder parameter** Starting with the 202303 version,\nintendedStatuses\nquery parameter in the finder request would be a record which would contain the expected array instead of directly accepting an array value. Instead of providingintendedStatuses=List(ARCHIVED,CANCELED)\nwe would require passingintendedStatuses=(value:List(ARCHIVED,CANCELED))\n.API Decoration Deprecation: In November 2022, we began deprecating API decoration for some APIs. Starting with the 202303 version, we will no longer support decoration on the following APIs:\nReminders\nMigrate to the new Community Management API before June 30, 2023\nWeâre accelerating our push to release more functionality that enables your customers to know and grow their professional communities â starting with a new Community Management API. Existing community management partners must migrate to the new API by June 30, 2023. Check out this article to learn more about our plans for community management.All access and refresh token requests should only be made using the POST method after June 30, 2023\nThis is a reminder that access token and refresh token requests should be made using only the POST method to/accessToken\nendpoint with the request headerContent-Type: x-www-form-urlencoded\nand all required parameters in the request body. We will start returning 400 errors on the GET /accessToken endpoint after June 30, 2023.\nFebruary 2023\nProduct & Platform Announcements\n- Posts API: Specify the sort order for finder results\nWeâre introducing an optionalsortBy\nparameter to the posts author finder to enable you to specify the sort order for finder results. You can sort by either last modified time or created time, in descending order. The default sort order is by last modified time in descending order.\nBreaking Changes\n- Ad Account Users API: API decoration deprecation\nIn November 2022, we began deprecating API decoration for some APIs. Starting with the 202302 version, we will no longer support decoration on theadAccountUsers\nAPI.\nReminders\nMigrate to versioned APIs and new Content APIs by February 28, 2023\nIn June 2022, we introduced API Versioning and new Content APIs to make it easier for you to build with ease and manage API changes with predictability. With the new APIs, we plan to sunset the unversioned APIs and legacy Content APIs on February 28, 2023.\nMigrate to the latest versioned API (February 2023) and the new Content APIs using this migration guide.\nYou can learn more about API versioning at LinkedIn and the new Content APIs through these videos: Versioning, Content APIs.Migrate to the new Community Management API before the end of June 2023\nWeâre accelerating our push to release more functionality that enables your customers to know and grow their professional communities â starting with a new Community Management API. Existing community management partners must migrate to the new API by June 30, 2023. Check out this article to learn more about our plans for community management.\nJanuary 2023\nProduct & Platform Announcements\nLinkedIn Marketing Developer Products refreshed with 2 API products LinkedIn Marketing Developer Products now has 2 API products the Advertising API to build paid marketing solutions and Community Management API to build organic marketing solutions. Check out the updated Developer Portal to learn more on what you can build, with which API, and how it benefits your customers. If you have a paid marketing integration, no action is required. If you have an organic marketing integration, you will need to migrate to the new Community Management API by June 2023 to keep your integration active.\nPosts API: Find posts authored by a specified member\nStarting with the 202301 version, weâre introducing a member author finder to enable you to fetch post contents authored by specified members. Results for all /posts finders (findByDscAccount and findByAuthor) will be sorted by last modified time in descending order (latest -> oldest) by default. This will help you manage post contents more efficiently.Ad Analytics API: Sort reporting metrics\nThe finder methods, Analytics and Statistics, of the adAnalytics endpoint now support two additional optional parameters:sortBy.field\nandsortBy.order\n. These parameters allow the results of these endpoints to be sorted in an ascending or descending order by one of the following fields:costInLocalCurrency\n,impressions\n,clicks\n,oneClickLeads\n,opens\n,sends\n,externalWebsiteConversions\n.\nBreaking Changes\nContent APIs: New batch size limit To handle batch requests more effectively, batch calls to the following endpoints: /creatives, /inMailContents, /posts, /videos, /images, /conversationAds, will only support 100 requests in a single batch, starting January 18, 2023. This change will apply to all versions.\nReminders\nMigrate to versioned APIs before the end of February 2023 We now support API versioning for all LinkedIn Marketing APIs â giving you the power to decide when to adopt API changes. We will release a new version every month and intend to support each version for a full year with its own set of documentation that covers all Marketing APIs. Continue to check the Recent Changes page to stay up to date on the latest releases.\nMake sure when calling an API version to include the request header with key âLinkedIn-Versionâ and set the value to correspond with the version youâre referencing using the YYYYMM format. Get started with this blog post, walk through video, or versioning documentation. Make sure to migrate before February 2023 when we will sunset unversioned APIs.\nNew Content APIs that simplify the content creation experience and save you time We introduced four new Content APIs that enable you to build quicker and to adopt the latest formats easier: Images, Videos, Post, and Creatives. With the new APIs, weâve reduced the steps to upload creative assets and create posts; and the APIs are built to support your workflow. Get started with the new migration guide. Make sure to migrate to the new APIs before February 28, 2023 when we will sunset the Shares and UGC APIs.\nArchived Marketing API Changes\nTo learn more about the Marketing API changes from November 2022 and earlier, refer to:"
  },
  "linkedin_versioning": {
    "hash": "f460ceedcef1bd0a5839efc8a6610a395aeb46632e8ed63250bd0297f19e9415",
    "text": "Note\nAccess to this page requires authorization. You can try signing in or changing directories.\nAccess to this page requires authorization. You can try changing directories.\nWarning\nDeprecation Notice\nThe Marketing Version 202408 (Marketing August 2024) has been sunset. We recommend that you migrate to the latest versioned APIs to avoid disruptions. See the Migration page for more details.\nIf you havenât yet migrated and have questions, submit a request on the LinkedIn Developer Support Portal.\nOverview\nAt LinkedIn, weâre continuously evolving our product offerings. Itâs important that our API partners are supported in this journey with the tools and experiences that enable them to innovate and deliver the best solutions to our mutual customers.\nWe understand the value of stable API integrations and the need for clear guidance on planning and making changes to your integrations. You experiment, build, test, and deploy new products all the time.\nTo support this, weâre introducing API versioning across our LinkedIn Marketing API Program. This will ensure your active integrations continue working while you integrate our latest changes.\nLatest Version\n| Version Name | Version Header |\n|---|---|\n| August 2025 | 202508 |\nWhatâs changing?\nLinkedInâs Marketing APIs first versioned API release was June 2022 under a new base path: https://api.linkedin.com/rest/\nOur versioned API releases follow a monthly cycle. There are several differences compared to the previous release cycle:\nLegacy (unversioned) Marketing APIs using the base path https://api.linkedin.com/v2/\nhave been sunset.\nSome of our legacy APIs (V2) have also been renamed and will be published according to the following table:\n| Legacy endpoint | Versioned endpoint |\n|---|---|\n| /adInMailContentsV2 | /adInMailContents |\n| /audienceCountsV2 | /audienceCounts |\n| /adSegmentsV2 | /adSegments |\n| /adAnalyticsV2 | /adAnalytics |\n| /sharesV2 | /posts |\n| /ugcPosts | /posts |\n| /adAccountsV2 | /adAccounts |\n| /adAccountUsersV2 | /adAccountUsers |\n| /adCampaignGroupsV2 | /adCampaignGroups |\n| /adCampaignsV2 | /adCampaigns |\n| /adCreativesV2 | /creatives |\n| /insightTagDomainsV2 | /insightTagDomains |\n| /adCampaignInsightsV2 | /adCampaignInsights |\nAPI clients will use HTTP headers to indicate the API version. Releases are titled according to the month in which the development work commenced - again, similar to the way we have pushed releases in the past. Comprehensive documentation and change guides will accompany each release. Our versioned Marketing APIs will be supported and stable for a minimum of one year before sunset.\nTechnical Documentation\nLinkedInâs LinkedIn Marketing API Program supports versioning so API partners can release changes over time. This document explains how to use versioned APIs.\nWhy are our APIs versioned?\nLinkedIn makes continuous improvements to our products, and thus our APIs must change too. But we want our API partners to have trust in stable integrations with reliable change schedules so that they can plan and execute better over time.\nThatâs why weâve created a stable supported window of one (1) year (minimum) for our Marketing APIs.\nHow your API client should use versioning\nHTTP headers will be used for clients to indicate which API version implementation they expect. Include a request header with the key âLinkedIn-Versionâ and set the value to the version (format: YYYYMM) to correspond with the documentation version youâre referencing, for example - âLinkedIn-Version: 202411â would indicate that you are using the version published in the month of November.\ncurl -X POST 'https://api.linkedin.com/rest/adCampaigns' \\\n-H 'Authorization: Bearer {INSERT_TOKEN}' \\\n-H 'Content-Type: application/json' \\\n-H 'Linkedin-Version: 202411â \\\n--data '{\n\"account\": \"urn:li:sponsoredAccount:123212321\",\n\"audienceExpansionEnabled\": false,\n`}\n...\nVersion Headers\nIn many cases, the URL resource paths your integration uses may not change across versions, but the behavior of the individual API methods will. For example, there may be new parameters required or new fields available on the response schemas.\nThe API changes must include the Version Header for the version (release) that needs to be adopted.\nExample\nFor the November 2024 LMS Release, the versioned header would be: \"LinkedIn-Version\": \"202411\"\n. Version headers are tied to the LMS Release date:\n| Version | Version Header Values |\n|---|---|\n| November 2024 | \"LinkedIn-Version\": \"202411\" |\n| October 2024 | \"LinkedIn-Version\": \"202410\" |\n| September 2024 | \"LinkedIn-Version\": \"202409\" |\nVersioned API Docs\nEach version of the LinkedIn Marketing API Program has distinct and comprehensive documentation covering all supported APIs. It also includes a changelog indicating all changes from the previous version indicating which resources have been updated or added. Initially, users will have the option on each page in the marketing folder to view: Versioned content: âMarketing {Month} 202Xâ.\nVersion Cadence\nLinkedIn Marketing API Program will publish new versions monthly, and those versions will be supported for a minimum of one (1) year.\nIndividual API resources may evolve at different times (e.g. a reporting API may be updated one quarter a year). And each API resource will have its own migration guide to help you navigate major updates.\nYou could choose to integrate with the newest API changes as soon as theyâre released or wait until youâre ready - as long as itâs within the one year change API support window.\nExpectations\nKeep up with us\nLinkedIn expects that our LinkedIn Marketing API Program API partners work to deliver the latest and most valuable experiences to our customers within a reasonable time of their availability. As a result, we will sunset our API versions as early as one (1) year after release.\nNo unversioned calls\nLinkedIn expects every versioned API call to specify a version; we will not default you to the latest version. Itâs important to us that customers have the best possible experience with LinkedIn integrations. And itâs more likely that customers have a great experience when the integration is being regularly maintained (at least once per year).\nBreaking Change Exceptions\nAt times, LinkedIn may need to change APIs within the supported stable window.\nLinkedIn reserves the right to release a patch version to any API if required for any critical security or privacy issues or bug fixes. While the likelihood of these scenarios is minimal, we will work closely with partners to minimize the impact of any breaking changes.\nFAQ\nWhich versions can I use?\nYou can use any version that hasnât been sunset. The documentation will reflect all available API versions. Migrating to the latest version, however, comes with two important benefits:\n- You can take advantage of all of our latest features.\n- You have the option to wait up to a full year before having to migrate again.\nHow do I migrate from an older API version to a later version?\nTo migrate your app from an older version to a later version, simply update the older versionâs YYYYMM\nformatted value in the header to the later versionâs value. For example, hereâs how youâd migrate from the November 2023 version to the November 2024 version.\n-H âLinkedin-Version: 202311â to -H âLinkedin-Version: 202411â\nReasons for migrating to a later version include:\n- Avoiding service disruptions; it's important to upgrade to a newer supported version before the older version is no longer supported (weâve committed to supporting each version for a minimum of one year).\n- Utilizing new features that are not accessible in the older version.\nWhich version of the API should I migrate to?\nWhile you can migrate to any later version of the API, migrating to the latest version comes with two important benefits:\n- You can take advantage of all of our latest features.\n- You have the option to wait up to a full year before having to migrate again.\nWhat happens if the Version Header is missing in the request?\nAn error response is returned when the version header is missing in the request. Refer to Sample Response here\nWhat happens if a deprecated Version Header is used in the request?\nAn error response is returned when the version header is deprecated (e.g., 202401). Refer to sample response here"
  },
  "linkedin_product_updates": {
    "hash": "0509726f7b1d636c08ea479702d158d06627d12a706d7d1cb10c70ec6ec318f3",
    "text": "03/31/25 - Expand your reach faster with Accelerate\nAccelerate is an AI-driven, objective-based campaign tool that merges LinkedIn’s professional data with your own (like retargeting or company lists) to pinpoint high-intent audiences. By introducing additional objectives, ad formats, and new audience inputs, you’ll have more ways to spark meaningful engagement and boost performance."
  },
  "meta_newsroom_instagram": {
    "hash": "350f4ff040fe77c522d6ae9d2623d456bfbcc6afc0623bccf18d4e7349c7b6c0",
    "text": "New Instagram Features to Help You Connect\nWe’re launching features that make it easier to connect with your friends on Instagram.\nTo help personalize content, tailor and measure ads, and provide a safer experience, we use cookies. By clicking or navigating the site, you agree to allow our collection of information on and off Facebook through cookies. Learn more, including about available controls: Cookie Policy"
  },
  "meta_ppcland_simplifies_apis": {
    "hash": "ef20323508b8f1b67df7f5534b9c774be525e4a012faf8ccbbc41a23b40c4962",
    "text": "Meta simplifies Instagram and marketing API integrations\nMeta updates Instagram and Marketing APIs to streamline developer workflows and improve data clarity.\nOn January 21, 2025, Meta announced significant updates to the Instagram Graph API and Marketing API, aimed at simplifying integrations for developers and businesses. The changes include the deprecation of several legacy endpoints and the introduction of new fields and metrics to enhance functionality and data clarity. According to the announcement, developers will have until January 21, 2026, to migrate Marketing API endpoints and until April 21, 2025, to update Graph API endpoints.\nThe updates focus on replacing older objects such as Instagram User\n, Instagram Media\n, Instagram Carousel\n, and Instagram Comment\nwith their newer counterparts: IG User\n, IG Media\n, and IG Comment\n. These changes are designed to provide parity for most use cases while removing redundant or outdated fields. For example, the Instagram Media\nobject will no longer support fields like filter_name\n, location\n, latitude\n, and longitude\n. Similarly, the permalink\nand caption\nfields for carousel child media will be removed.\nThe IG User\nobject introduces new fields such as has_profile_picture\n, is_published\n, and edges like /authorized_adaccounts\n, /agencies\n, and /upcoming_events\n. These additions aim to provide more comprehensive data for developers. The follow_count\nand followed_by_count\nfields have been renamed to follows_count\nand followers_count\n, respectively, while profile_pic\nis now profile_picture_url\n.\nFor media objects, the taken_at\nfield in Instagram Media\ncorresponds to the timestamp\nfield in IG Media\n. The content_type\nfield, which previously returned an integer, now returns an enum string value (e.g., 0 → IMAGE, 1 → VIDEO, 4 → BROADCAST, 8 → CAROUSEL_ALBUM). The caption_text\nfield in Instagram Media\naligns with the caption\nfield in IG Media\n, though carousel child captions will no longer be available. The display_url\nand video_url\nfields have been consolidated into a single media_url\nfield, simplifying data retrieval.\nThe Instagram Comment\nobject has also been updated. The instagram_user\nfield now corresponds to the user\nfield, which returns an IG User\ninstead of an Instagram User\n. Meta has introduced new ID fields, such as ig_user_id\n, ig_media_id\n, and ig_comment_id\n, to facilitate the transition from legacy objects. These fields will remain available until April 21, 2025.\nIn the Marketing API, fields like instagram_actor_id\nand instagram_story_id\nwill be replaced with instagram_user_id\nand instagram_media_id\n, respectively. Any edge that previously returned an Instagram User\nwill now return an IG User\n. According to the announcement, several endpoints will no longer support legacy objects starting January 21, 2026. These include /generatepreviews\n, /act_<adaccount_id>/generatepreviews\n, and various endpoints for ad campaigns, creatives, and async ad requests.\nFor the Graph API, legacy objects will no longer be supported after April 21, 2025. Affected endpoints include those for retrieving Instagram user data, media, comments, and carousels, as well as endpoints for managing Instagram accounts linked to Facebook Pages and business assets.\nMeta has also introduced changes to the Insights API to improve metric clarity. In August 2024, Instagram introduced views\nas the primary consumption metric for measuring content performance across reels, live videos, photos, carousels, and stories. Starting with API v22, the views\nmetric will be available for both media and user insights. For media insights, Feed, Story, and Reels objects will return views. User insights will support the views\nmetric with multi-dimensional breakdowns for follower type and media product type.\nSeveral older metrics will be deprecated in v22. These include plays\n, clips_replays_count\n, and ig_reels_aggregated_all_plays_count\nfor media insights, as well as impressions\nfor both media and user insights. The impressions\nmetric will only be deprecated for media created on or after July 2, 2024. For older media, the API will continue to return impressions\nvalues as usual.\nAccording to the announcement, these updates aim to align the functionality of the Instagram API with the Instagram app, providing businesses and creators with more accurate and actionable data. Developers are encouraged to review the changes and update their applications by the specified deadlines to avoid disruptions.\nThe January 21, 2025 announcement reflects Meta’s ongoing efforts to streamline its developer tools and improve data transparency. By consolidating endpoints, introducing new fields, and refining metrics, the company aims to make it easier for developers to build solutions that meet the needs of businesses and creators.\nThese updates come at a time when digital platforms are increasingly focused on providing clear and reliable data to users. The shift toward views\nas a primary metric underscores the importance of understanding content performance in a way that aligns with user behavior.\nMeta’s approach to simplifying API integrations and enhancing data clarity demonstrates a commitment to supporting developers and businesses in a rapidly changing digital landscape. The changes announced on January 21, 2025, are expected to have a significant impact on how developers interact with Instagram and Marketing APIs, paving the way for more efficient and effective solutions.\nAs the deadlines for migration approach, developers and businesses will need to carefully review the updates and plan their transitions accordingly. The availability of new fields and metrics, along with the deprecation of legacy objects, represents a significant step forward in the evolution of Meta’s developer tools."
  },
  "zoomph_views_transition": {
    "hash": "dfc9688f685c336314eab314811f85e0a49e171e5e1c541832968b681215ffec",
    "text": "Instagram Metric Deprecation & Views Transition (April 2025)\nMeta (Instagram’s parent company) is making important updates to how performance metrics are delivered via their API. These changes will directly affect metrics like Impressions and Plays. Please read below to learn more. To stay ahead of this update and ensure a smooth transition for our customers, Zoomph is updating its platform to support Meta’s new Views metric and remove deprecated metrics.\nWhat’s Changing in the Instagram API?\nMeta will deprecate the following metrics for all versions of the Instagram API on April 21, 2025. Zoomph will implement supporting changes on April 17, 2025.\n- Impressions\n- Plays (on Reels, this includes Replays on Reels as well)\nInstagram's API is introducing a new metric, \"Views\" to replace both \"Impressions and \"Plays\".\n-\nViews is defined as any time a Reel plays (or is replayed) on a screen, or when a feed post, carousel, or story is displayed on screen (including repeat views). Meta introduced this new metric to provide a consistent, unified standard across all content types.\n- For Reels, a View is count if the reel plays for 0.1 seconds on screen.\n- Views will include every instance content is displayed - even if the same user views it multiple times.\n-\nThis change may result in higher reported numbers for non-video formats compared to Impressions\n-\nBased on our research, Views are, on average, 25% higher than Impressions.\n🔗 View Meta’s official changelog\n✅ What Zoomph Is Updating\nTo ensure reporting continues smoothly and remains aligned with Meta’s standards, Zoomph will make the following changes:\n📅 Effective April 17, 2025\nOn Authenticated/Owned Instagram Content:\n-\nThe new Views metric will appear for all Instagram posts (Feed Posts, Reels, Stories, and Carousels) created after April 17, 2025.\n-\nThe Social Value metric will now use Views against Instagram CPM for all content created after that date.\n-\nLogo Impressions on Instagram content will be based on Views.\n-\nVideo Views, previously deprecated, will no longer appear. Views is now the primary video performance metric.\nOn Unauthenticated/Earned/Non-Owned Instagram Content\n- Projected Impressions will be renamed to “Projected Views”.\n- Logo Impressions will now be based on \"Projected Views\".\n-\nThe Social Value metric will use Projected Views against Instagram CPM for all content created after April 17, 2025.\nAcross All Instagram Content:\nReporting Dashboards:\nZoomph will display “Views/Impressions” when aggregating metrics across multiple platforms (e.g., X/Twitter, Facebook, and Instagram) in:\n- Social Overview Reports\n- Custom Social Reports\n- Brand Reports\nFor example, if you have a feed that aggregates X(Twitter), Facebook, and Instagram post data, all reporting dashboards will aggregated \"Views\" from Instagram and \"Impressions\" from the other platforms together under a \"Views/Impressions\" label.\nPost Export\n- The export will now display “PostViewsImpressions” (replacing “PostImpressions”)\n-\nThis column will reflect Views for Instagram and Impressions for other platforms.\nZoomph API and Brand Export:\n- Zoomph’s API and Brand Exposure Export will continue to use the column header “Impressions” to avoid disruption to existing integrations.\n- Instagram Views will be passed into the existing “Impressions” column.\n- No new columns will be introduced at this time.\n- The Impressions metric will no longer be available for Instagram content on Zoomph’s platform or API starting April 17, 2025.\n- Historical Impressions data will remain available for content created before this date.\n- Posts created prior to April 17 will continue to use Impressions to calculate metrics such as Social Value, Engagement, and Logo Impressions.\nFrequently Asked Questions\nQ: Will historical Impressions be deleted?\nA: No. Impressions data for content created before April 17, 2025 will remain available in Zoomph.\nQ: Will this impact my brand value and brand impressions reporting?\nA: Yes — beginning April 17, Views will become the basis for brand value calculations in place of Impressions.\nQ: If I use the API, do I need to update my API integrations?\nA: No.\nNeed Help?\nIf you have questions about these changes or need support with custom integrations or exports, please reach out to your Zoomph Account Manager or contact us at support@zoomph.com."
  },
  "later_instagram_algorithm": {
    "hash": "cdf5180635898d3777a693b957921f47a734d1531c230a0ac247e74c41505c03",
    "text": "How does the Instagram algorithm actually work?\nIt's a common question amongst social media managers, creators, and anyone trying to grow on social.\nWe’re breaking down how the Instagram algorithm works in 2025, the top ranking factors, and our top tips for hacking the algorithm for more engagement for your brand.\nLet’s get started.\nReady to work with the algorithm—not against it? Start your free trial with Later and schedule content that drives real engagement.\nTable of Contents\n- What Is the Instagram Algorithm?\n- How Does the Instagram Algorithm Work?\n- How the Instagram Algorithm Works for Feed Posts\n- How the Instagram Reels Algorithm Works\n- How the Instagram Story Algorithm Works\n- How the Instagram Explore Page Algorithm Works\n- How to Reset the Instagram Algorithm\n- 7 Tips to Beat the Instagram Algorithm in 2025\n- How to Get Ahead of the Instagram Algorithm\nWhat Is the Instagram Algorithm?\nThe Instagram algorithm is a system used by the social media platform to determine the order in which content is displayed in a user's feed.\nYou’ll often hear the Instagram algorithm referred to as a singular concept, but there are really multiple algorithms at play.\nIn fact, Instagram describes it as a \"variety of algorithms, classifiers, and processes, each with its own purpose. We want to make the most of people’s time, and we believe that using technology to personalize everyone’s experience is the best way to do that.\"\nIn other words, Instagram's algorithms have one goal: to make you stay on the app longer by delivering content you'll find relevant and interesting.\nThe algorithm majorly affects how social media managers work.\n“Instagram’s algorithms impact the day-to-day life of just about social media professional in big ways,” says Later’s Social Team.\n“In order to create best-in-class content that drives growth and engagement, we’re required to produce a wide range of assets—from videos to statics, carousels, stories, to lives, and more—multiple times a day, every day.”\nHowever, you can use it to your advantage.\nBy tailoring your strategy to \"hack\" what Instagram's algorithm is prioritizing — so you can reach more users and build a community of engaged followers.\nHow Does the Instagram Algorithm Work in 2025?\nThere are multiple factors that Instagram will use to evaluate its algorithm in 2025, depending on what you’re posting.\nAccording to a deep dive into ranking from Instagram itself, each algorithm uses different “signals” to determine what will rank on your feed.\nThe major takeaway? Each Instagram algorithm ranks content based on different signals:\nThe Instagram Feed algorithm: Your activity in-feed (likes, comments, shares, and saves), and info about the post and the person who posted.\nThe Instagram Stories algorithm: Stories you've viewed or engaged with in the past.\nThe Instagram Explore Page algorithm: Your activity in Explore (likes, comments, and shares), and info about the post and the person who posted.\nThe Instagram Reels algorithm: Your activity in Reels (likes, comments, shares, and saves), and info about the Reel and the person who posted.\nHere’s what all of these signals have in common: The algorithm will reward content that resonates with your audience.\nRead on for an in-depth breakdown of how each algorithm works.\nHow the Instagram Algorithm Works for Feed Posts\nRemember the days when your Instagram was a chronological story of what your friends were eating for lunch that day?\nNow, things are a little more complex.\nThe feed now consists of Reels and posts from followed accounts as well as suggested content.\nThe signals the Instagram algorithm uses to evaluate feed posts are:\nYour activity: Users see content from topics and accounts that they're already liking, saving, or sending.\nInformation about the post: If a feed post is going viral or has a high engagement rate, Instagram is more likely to include it in the feed.\nInformation about the poster: People get recommended posts from users who are similar to the ones they already follow and interact with.\nYour history of interacting with someone: If you’re always liking someone’s posts or frequently visiting their profile, the algorithm will consider this.\nThe moral of the story is the higher the engagement your posts have, the better.\nTIP: Use Later's Instagram Analytics to understand which posts deliver the highest engagement for your account and optimize your strategy.\nHow the Instagram Reels Algorithm Works\nKnowing how to \"hack\" the Reels algorithm can be a huge advantage for anyone looking to grow on Instagram.\nMuch like feed posts, Instagram prioritizes Reels based on what it believes a viewer will be most likely to interact with.\nThe signals it uses to determine Reels ranking are very similar to feed posts:\nYour activity\nInformation about the reel\nInformation about the poster\nYour history of interacting with someone\nAccording to Instagram, brands and creators should create Reels that are entertaining, inspiring, or experimental and use creative tools like text, camera effects, or filters.\nPsst, bookmark this blog for additional Reels tips: The Ultimate Guide to Instagram Reels.\nHow the Instagram Story Algorithm Works\nThe Instagram story algorithm works a little differently, as you don’t see accounts you haven’t followed in your Story feed (yet).\nHowever, the key ranking signals for the Instagram Story algorithm are similar:\nViewing history: The algorithm will start by showing people the stories they know they’ll enjoy (so they’ll stay on the app longer, of course).\nEngagement history: People are served stories from accounts that they’ve previously DMed or reacted to.\nCloseness: The algorithm evaluates how likely it is that an account comes from a close friend or family member. That’s why you’ll often see Close Friends’ stories show up at the beginning of the Story feed.\nICYMI: With Later, you can plan and automatically publish your Instagram Stories, add captions or links, and set a publish time.\nStart scheduling your Instagram Stories in advance with Later with a free trial of any plan.\nHow the Instagram Explore Page Algorithm Works\nThe Instagram Explore page algorithm delivers content that it thinks you’ll be most interested in, based on your prior interactions.\nWhile your Instagram Home feed is mostly made up of content from accounts you already follow, the Explore feed consists entirely of content from new accounts.\nThe signals the algorithm uses to rank Explore posts include:\nInformation about the post: How popular a post seems to be — like how quickly users are interacting with it. These signals matter much more here than they do for Feed and Stories.\nActivity in Explore: How you've interacted with posts in the past.\nInformation about the person who posted: How many times people have interacted with them in the past few weeks.\nThe Explore page is constantly evolving, with new topic categories and advanced search functionalities being introduced all the time.\nSo, by continually sharing engaging content with strong captions, relevant keywords, and niche hashtags, you’re optimizing your posts for Explore page potential.\nTIP: Write your Instagram captions in advance with Later's Instagram Scheduler.\nHow to Reset the Instagram Algorithm\nShort answer: You can't \"reset\" the Instagram algorithm.\nIf your account isn’t appearing on any feeds, you may have been “shadowbanned”. Read this post to learn what shadowbanning is - and how to undo it.\nHowever, there are a couple of ways you can refresh the content shown in your feed:\nBy clearing your search history\nBy tapping \"Not Interested\" on suggested posts\nThe good news? If you haven't been shadowbanned, there's plenty you can do to boost the chances of others seeing your content (keep reading).\n7 Tips to Beat the Instagram Algorithm in 2025\nIf you want to improve your ranking with the Instagram algorithm, the best thing you can do is drive as many interactions (likes, comments, saves, and clicks) as possible.\nAnd by building momentum with your existing community, you’ll soon find your content surfaced to new audiences.\nHere are seven ways to improve your algorithmic ranking and reach new audiences:\nTip #1: Use Instagram SEO\nOptimizing your Instagram for search - whether that be through the Explore page or through the search bar - is one of the best ways to keep your account discoverable.\nAnd when it’s easy to find your content, you’ll be encouraging those interactions that the algorithm sees as strong signals.\nFrom using keywords in your captions and profiles to adding subtitles to Instagram Reels, Instagram SEO is an essential social media tool.\nTip #2: Encourage More Interactions with Instagram Stories Stickers\nInstagram Stories stickers are a great way to encourage audience engagement — and the more engagement your posts get, the higher they’ll be boosted by the Instagram algorithm.\nThere are lots of Instagram stickers, but the best ones for driving engagement are the poll, emoji slider, and question stickers.\nTIP: Include a sticker on your first story for an added boost!\nTip #3: Drive Conversations with Engaging Captions\nInstagram has confirmed comments and likes are important when it comes to feed ranking — so it’s a good idea to encourage as many as possible for your posts.\nOne of the best ways to do this? Write strong captions that drive engagement.\nThis could be as simple as asking your followers to share their thoughts, double-tap if they agree, tag a friend in the comments, or click the link in your bio.\nWith Later's AI Caption Writer, you can create on-brand captions in seconds — no brainstorming required.\nTip #4: Add Relevant Hashtags to Your Posts\nAdding hashtags to your posts is an effective way to reach more people on Instagram, which means more “views” for the Instagram algorithm to take into account.\nIt’s important to focus on quality, hyper-relevant hashtags — even using 5 or 10 hashtags is better than zero.\nUse Later's Hashtag Suggestions tool to automatically find relevant hashtags for your posts based on your caption and other hashtags you search. Work smarter, not harder.\nTip #5: Optimize for Views\nInstagram head Adam Mosseri announced in the summer of 2024 that Instagram’s analytics would be views-focused and that users should optimize for Views instead of likes and engagement.\nThis update indicates that you should evaluate your content’s success on how visible it is.\nWhile we don’t have this confirmed, this also suggests that Views might be seen by Instagram’s algorithm as a strong ranking signal.\nSome ways you can optimize for Views include:\nCreating trends-focused content\nCollaborating with other creators\nEngage with your audience\nPost at your personalized Best Time to Post\nTip #6: Cross-promote Your Instagram Content\nIf you’re looking for a quick and easy engagement win to help boost your algorithm ranking, cross-promoting your Instagram content is a great place to start.\nInstagram Collabs posts (with co-shared authorship) are an incredible new way to reach new audiences.\nYou’ll share views, likes, and comments — allowing you to leverage and engage with each other’s communities.\nTip #7: Use Instagram Analytics to See What’s Working\nTracking and monitoring analytics is one of the most reliable ways to take on the Instagram algorithm.\nHaving a better understanding of what’s working (and what isn’t) will help you come up with a finely-tuned marketing plan, saving you time and effort in the long run.\nBut diving into your Instagram Analytics means more than just finding out which photo, video, or Reel performed best.\nTruly understanding how your content performs — by tracking key metrics over time — is vital to knowing what helps improve your ranking.\nThe easiest way to do this? Later’s Analytics feature:\nThe tool lets you track up to 12 months' worth of Instagram feed posts, Stories, and Reels so you can see exactly what's performed best — and filter by key metrics like engagement, followers, reach, likes, and more.\nPlus, you can export your Instagram analytics directly to your desktop (in a CSV file) making it easy to keep all of your numbers in spreadsheet format.\nHow to Get Ahead of the Instagram Algorithm\nThe best way to gain an advantage with the Instagram algorithm in 2025?\nKnow your niche, create engaging content, and be consistent. The Instagram algorithm will do the rest.\nTIP: Plan your Instagram content in advance so you can have an organized content calendar (and save time!). Start a free trial with Later today."
  },
  "instagram_developer_graph": {
    "hash": "b8877057c3f1e0c41bcd7933228f6074dc3f9f0e4615a730f66a670734d66861",
    "text": "Với API Instagram qua phương thức Đăng nhập bằng Facebook, Tài khoản công việc trên Instagram - Doanh nghiệp và Người sáng tạo nội dung - có thể dùng ứng dụng của bạn để quản lý sự hiện diện của họ trên Instagram. Họ có thể dùng API này để lấy và đăng file phương tiện, quản lý cũng như trả lời bình luận về file phương tiện, xác định file phương tiện mà người dùng khác trên Instagram đã @nhắc đến họ, tìm file phương tiện có hashtag, lấy số liệu và siêu dữ liệu cơ bản về những Doanh nghiệp và Người sáng tạo nội dung khác trên Instagram.\nTiếp theo, hãy tìm hiểu về các khái niệm cốt lõi, thành phần và yêu cầu về cách sử dụng dành cho API Instagram trong phần Tổng quan."
  },
  "reddit_instagram_marketing": {
    "hash": "fd90bdedc87b1d2933d7e0ded344a894c52838045010c8e2ff2b5c4b6dfaa4a3",
    "text": "A couple I know has seen my social media work on different platforms and want to hire me, mostly for reels, for the coffee shop they own and are only wanting a couple a week. What would you charge for this? The reels I usually make are NOT super production heavy and are mainly short comedy skits I film on my iphone. I usually average 4k-25k views with a solid amount of organic engagement. I also live in the midwest so marketing/social media is not super lucrative compared to cities so I’m trying to figure out a fair price for them without undervaluing myself.\nThe CEO of Instagram just confirmed it: hashtags are no longer the magic growth trick they used to be. They barely move the needle for reach anymore.\nIf you want to grow faster on Instagram in 2025, here’s what you should be doing instead:\n-\nProfile Settings → Account Privacy → Turn ON “Allow public photos and videos to appear on Google.” This helps your content show up outside Instagram’s walls\n-\nProfile Settings → Media Quality → Turn ON “Upload at highest quality.” Instagram prioritizes crisp, high-res uploads in recommendations.\n-\nBefore posting a Reel → More Options → Turn ON “Recommend on Facebook” and “Recommend on Explore.” These push your content to more viewers without them following you.\n-\nOn desktop → Edit Profile → Enable “Suggest your profile to art lovers” (or relevant audience setting for your niche). This makes Instagram actively promote your profile to people who care about your content’s topic.\nTL;DR: Hashtags aren’t dead because of a conspiracy — they’re just not how Instagram finds and recommends posts anymore. Turn on these settings and let the algorithm actually work for you.\nWant more than just reach? At Layba.gg, we help small creators monetize their content across Instagram, TikTok, and YouTube Shorts. Join our creator community, learn growth strategies like this, and start turning your audience into actual income.\nWhat do I do to hide my posts from my friends and have reach with other people?"
  },
  "reddit_linkedin_marketing": {
    "hash": "0bd3d1e297d7c52c4faa717b86022cfb28a939c94780e23c4bcd19b08df8c233",
    "text": "You agree that use of this site constitutes acceptance of Reddit’s User Agreement and acknowledge our Privacy Policy."
  }
}